{
    "0": {
        "course-section": "CMSC 14100 2",
        "instructors": "Timothy Ng, Jesus Almaraz-Argueta",
        "quarter": "(2228) Autumn 2022",
        "comments": {
            "What are the most important things that you learned in this course? Please reflect on the knowledge and skills you gained.": [
                "I reviewed and learned many basic concepts of python that were really helpful in completing the homework. The basic concepts were also essential to understand more complex ideas like recursion, dictionaries, and OOP.",
                "Basics of working with Python",
                "Basics of python",
                "Learning how to code and problem solve, and how to approach problems multiple times to create efficient solutions",
                "intro mindset to coding, proper formats of coding, and python",
                "Basic Python structures and understanding how to apply them to solve problems presented to us.",
                "Python, GIT, recursion.",
                "Since I did A–level in Computer Science and had previous experience in CS, I did not find any information new.",
                "Recursion",
                "Recursion, data structures, for loops, conditionals, etc. in Python",
                "Programming basics, data structures, functions, recursion",
                "loops, classes, recursion were the main things",
                "Types in Python, loops, how to create/implement classes and objects, recursion",
                "Basic programming syntax",
                "I learned about the fundamentals, supported data structures, and functionality of Python.",
                "Basic python skills, how to think critically and improve problem solving skills.",
                "Recursion",
                "I learnt the basics of python programming, linux and how to navigate through github."
            ],
            "Describe how aspects of this course (lectures, discussions, labs, assignments, etc.) contributed to your learning.": [
                "The lectures were continuous such that we would essentially pick up where we left off so I was able to easily pick up new concepts and link them to the ones we already learned.",
                "The homeworks were difficult but made me understand how to work with the concept much better.",
                "Homework and midterm were the right level of challenge",
                "The lectures allowed me to learn both theoretical concepts and their practical applications",
                "The discussion sections allowed me to learn how to collaborate with classmates on problems",
                "Professor Ng's lectures are clear and helpful to understand the concepts. Great practices in discussion. Assignment is harder than lecture but fairly manageable.",
                "Lectures were useful for understanding basic theory of new material, but discussion sections, where we were given similar problems and worked through them, helped to really understand how to solve each week's assignment. Office hours were most useful for understanding our problems or where we are confused. However, changing the system around midway through the quarter to a waiting room where only one student can talk to a TA at a time made progress substantially slower.",
                "Homework was relevant and fun to complete. You can see that this is one of the most well–organized courses at UChicago, with coherent homework, lectures, and discussion sections. Code quality feedback from TAs was nice to have. I appreciate the TAs for spending so much time reading the messy codes I write.",
                "I found assignments to be the most useful in my studies. Specifically the Project assignments.",
                "Classes are kind of iffy and fast paced. The homework is where things are really absorbed for me",
                "Lectures were pretty good but not 100% necessary, assignments were hard as hell, discussion sections were mostly useless but occasionally priceless",
                "Working with friends on homework and projects was the most important part of learning from the class",
                "Lectures were very informative and helpful",
                "The lectures were very interesting with Prof Ng. Was especially helpful that he had lecture notes, learned mostly through those.",
                "Lectures were not that helpful in the moment – the textbook and lecture notes were definitely more helpful. Homeworks forced me to internalize the concepts I learned, and discussions gave good practice problems I could discuss with other people and reference later on as well.",
                "Discussions are helpful",
                "The lectures and Professor Ng's corresponding notes were very thorough and easy to follow, helping me to retain the material. Spencer's discussions were very informative and helped get me accustomed to the \"be–a–computer\" problems.",
                "Class notes posted online by Professor Ng as well as the textbook were the most helpful resource besides going to office hours.",
                "I didn't go to class but the assignments were not bad",
                "The lectures taught me the functions to use in python. The discussion sessions taught how to interpret and approach \"be–a–computer\" problems."
            ],
            "Additional comments about the course:": [
                "Many people, including me, did not like the grading structure really well, as for the homework, getting two needs improvements will lock one from getting an A, which we thought is counterproductive, as once people know they won't get an A, their will drop their effort to A– at best.",
                "Code \"completeness\" (= whether it runs properly) is weighted equally with code \"quality\" (= aesthetic judgements about how you wrote it), which I didn't love",
                "The course went pretty quickly like we would jump from typical functions to classes. I think if we had more time to cover trees and recursion in more detail, i would like that. Discussion was not as helpful but also just the grouping of students I did not enjoy bc some students would know more than others (which is great), but would not slow down / help the other understand.",
                "Very intense workload, but I felt that what I was learning was meaningful and useful. I overall enjoyed learning Python in this course, but it came with a lot of work (more work than any other class I've had at UChicago).",
                "I thoroughly enjoyed this course and think my coding skills improved vastly because of it!",
                "I was not a beginner to CS, so the class was alright. However, I do think it will be pretty hard for people with no background CS experience at all.",
                "As a beginner of this course, this course poorly taught me how to approach computer science as the homework and projects were unrealistically challenging. Although the rigour of this course is heightened by the quarter system, this course does not teach python to beginners well. There should be leeway in this course, for homeworks and assignments, to let beginners explore and learn computer science at a more manageable pace."
            ],
            "Thinking about your time in the class, what aspect of the instructor's teaching contributed most to your learning?": [
                "He was open to and often encouraged questions and those questions were very helpful in understanding more about the data structures or other concepts taught in class.",
                "Lectures",
                "Office hours",
                "Being very open and understanding to students' questions",
                "leading us through concepts and problems",
                "He was very straightforward on what we would see, and how we would be able to deal with them in a general sense.",
                "Professor Ng's lecture notes posted online were helpful. He is very logical and straightforward with his teaching.",
                "Nothing.",
                "Examples and clear definitions.",
                "Lectures",
                "Notes and lectures",
                "I liked how clear he was in explaining how to use the methods we learned syntactically.",
                "I appreciated Professor Ng's lecture notes (posted online) – they were helpful because often I didn't understand what was happening in class.",
                "Professor Ng was very good about explaining the theory behind different concepts and illustrating examples both through IPython and on the chalkboard. He also welcomed questions and gave very helpful answers.",
                "Professor Ng had really clear and organized notes posted to his website, these were great especially considering it could be hard to see the board in class or if you missed something in lecture.",
                "Teaching us how to write and interpret basic python functions."
            ],
            "What could the instructor modify to help you learn more?": [
                "I would have liked more about CS theory rather than just python stuff that we could have learned on YouTube",
                "record the lectures",
                "The instructor could discuss examples in class that are more closely related to the problems assigned that week.",
                "I think Professor Ng asked too many questions in class. It sometimes dragged the lecture's pace down and made it boring.",
                "Make on the screen more visible.",
                "",
                "Be less engaged in communicating with the class and rather just deliver information non–stop. Otherwise, the same questions get asked every class and we spend time unproductively.",
                "Rebalance lecture time to spend more time on harder subjects and less on easier ones.",
                "As extensive as the API for our assignments was, edge cases were regularly omitted from assignment descriptions and you had to instead go into the auto–grader code to find which weird edge cases your code was failing. Might've liked more transparent expectations for our code up front",
                "(To all the instructors):",
                "Please provide a more organized office hour structure throughout the quarter.",
                "",
                "Additionally, I believe that the code quality standards were too high and penalized people for small mistakes that could in turn have a huge effect on what their grade could be.",
                "",
                "Overall, I don't think that having more than one un–Satisfactory score (out of 2 per each homework and 4 for each project) should completely eliminate someone's chance of getting an A in this class, because that sends the message that what you're looking for is an experienced coder in your class which is supposed to be targeted to beginners.",
                "Nothing to change!",
                "Instead of teaching beginners how to write code perfectly, there could be some space to let beginners learn programming by using more basic and 'messier' code to approach assignments."
            ]
        }
    },
    "1": {
        "course-section": "CMSC 14100 4",
        "instructors": "Timothy Ng, Jesus Almaraz-Argueta",
        "quarter": "(2228) Autumn 2022",
        "comments": {
            "What are the most important things that you learned in this course? Please reflect on the knowledge and skills you gained.": [
                "Python, basic object–oriented programming and recursion.",
                "I learned fundamental topics in programming, starting from iteration and ending with recursion and its implementation in several data structures.",
                "I learned basic Python and problem–solving in general, having absolutely no coding experience prior to this class.",
                "Basic python; lists, dictionaries, sets, iterative and recursive loops, data structures and trees",
                "I learned about the fundamentals of Python and what you can do with these fundamentals.",
                "Python up until classes and objects, recursion and binary trees",
                "coding in python",
                "Learn how to meet the code quality requirenet other than just writing codes that provide the correct results.",
                "Introduction to programming in python.",
                "python?",
                "class, recursion, data structures, functions",
                "basic terminal commands, loops, recursive structures, classes/objects",
                "Going over the basics – But the problems get hard enough to still somewhat challenge experienced coders.",
                "This course was based on Python. Data structures, loops, recursion.",
                "The fundamentals of computer science theory: how to approach problems. Programming basics",
                "Introduction to how to code in Python.",
                "make friends in this course. if you are completely new to coding, please join a cs study group. this class is really difficult, even for those with at least a year of experience.",
                "Programming basics, specifically Python. From functions, variables, loops, classes, libraries, files, and more. As someone’s with zero experience, this class was excellent at teaching these concepts especially considering the time frame (9 weeks). I feel like what I’ve learned in this course did an excellent job building a base for my future programming career.",
                "Intro to Python",
                "Basics of python, problem solving, computational thinking",
                "Python syntax, basic data structures, how to break down complex problems into manageable bits."
            ],
            "Describe how aspects of this course (lectures, discussions, labs, assignments, etc.) contributed to your learning.": [
                "Tim's lectures were very good; he explained things clearly with good examples. Office hours were often overfull or just had too many people to get real answers, so either go to office hours way before the homework is due or prepare to wait for an answer.",
                "The homework helped me prepare for the midterm and also reinforced the concepts learned in class.",
                "The homework was very challenging, especially for someone with zero experience. However, I found them to be useful in actually understanding the material. However, I think it got to the point on some assignments that they were so hard it did more harm than good. Discussions were moderately helpful, though.",
                "Discussion sections were helpful, lectures were kind of confusing and fast paced. As an actual beginner, I felt like the weekly homework assignments were difficult and I spent a lot of time on it.",
                "I really enjoyed Professor Ng's teaching; he made CS feel more doable for me.",
                "Lectures helped introduce us to the concepts however their difficulty was really low compared to the homeworks and what was expected on them. Discussion sections helped clarify the contents a bit.",
                "discussion session problems, homework, projects",
                "The discussion sessions were helpful as we did a lot of practice problems to enhance of understanding of codings without the help of a computer.",
                "Lectures and problem sets/projects were very helpful.",
                "lectures are helpful. homework helps me master the materials. However, discussion sessions are most helpful in preparing for midterms and exams",
                "Office Hour: My fav thing about this class (the only reason why I survived it) is the speed at which professors and TAs respond to questions on Ed. I find in person office hour completely useless (due to extreme inefficiency) so the instructors should think more about how to improve that experience. However, lots of gratitude for instructors and TAs as their help over Ed is extremely essential to my learning.",
                "Exams: okay sure we need exams but can we talk about the fact that we are writing code on paper? It is an absurd practice. My roommate saw my scratch papers and asked why I wrote code on paper and I told her that I had to practice writing code on paper correctly for the exam. This is quite absurd. But if this has to continue being the case, can we get more practice of writing code on paper correctly from the class? It is one thing to be able to write code on laptop and debug to make sure everything works and another thing to write code on paper without debugging and still get everything to work. For example, maybe we need 2h of discussion sessions every week. Or, we should have some weekly quizzes (not graded) where students are required to write codes down on paper. But anyway, this is the most absurd part of this course. All other parts are essential to my learning.",
                "discussion sections were very integral in the process, as well as the psets",
                "The Homework / Projects and being told better ways to perform certain tasks",
                "Lectures were good at providing exposure to topics, but it was working through the assignments where the real learning of the course came. The assignments were mostly reasonable.",
                "Homeworks were incredibly helpful to build programming skills. Projects were also good evaluations of knowledge. Lectures and discussion sections were engaging.",
                "Lectures were helpful and Professor Ng explained concepts well. Homework and project assignments often are difficult and can extend beyond what was taught. Discussions all consisted of group work and were relatively unhelpful.",
                "Lectures were very well organized and the entire course was planned nicely to smoothly teach and transition us from one topic to the other. While the P–Sets can be very challenging at times, they definitely helped us understand the material well. It’s like giving someone a hard math problem so they’re able to deal with anything thrown at them.",
                "Lecture notes were very very helpful",
                "Lectures were comprehensive, discussions were the most useful and assignments were good practice",
                "The book + Prof Ng's lecture notes were great, but lecture was the best part of this class."
            ],
            "Additional comments about the course:": [
                "Because it was a new course, I think the structure was a bit hectic and office hours were a little disorganized.",
                "This course was really difficult, especially if you have no background coding experience. I honestly would not recommend unless you're willing to dedicate a lot of time and/or need it for major.",
                "This course is called Intro to Computer Science I. Thus, one can see that it should be aimed at students who are actually new to coding rather than those with ample of years in experience. The burden should not fall on genuinely new students of computer science as to how they can cope with people who have done coding for years in advance. As a first year, it's just demoralising struggling through an introductory class where others are fleeting by since they just have so much experience. While the homeworks and rigorous and help you gain a substantial amount of knowledge in a shorter period of time, the expectations are nearly impossible to reach and there is a big disparity as to what is taught in the lectures and what is tested in the HW.",
                "Pretty good. Gained a helpful amount of knowledge about python and programming.",
                "Although it's an intro course, it will be incredibly difficult for someone who has absolute no coding background, because of how fast the course is paced and the fact that many people who take this class do have coding experience (destroys curve).",
                "I felt like the grading system made it very hard to do well in the course",
                "Difficult but doable."
            ],
            "Thinking about your time in the class, what aspect of the instructor's teaching contributed most to your learning?": [
                "The instructor asked meaningful questions that helped clear up misconceptions about the new material.",
                "Lectures were super helpful in very basic understanding of the concept, but when it came to the homework, I feel like it was much harder than the basic concepts learned during the actual lecture.",
                "I'm not sure...",
                "I liked how Professor Ng would go through the code with us and also write it out on the board.",
                "Office hour",
                "There are lecture notes posted online after each lecture, which is very helpful when I missed some part during class.",
                "The lectures were very well presented, and the lecture notes were very well put together and helpful.",
                "notes",
                "Not only did Tim give a lot of examples in class, he also posted his lecture notes which was quite helpful.",
                "He took a very methodical approach which was nice",
                "Timothy answered questions effectively and he took care in structuring his lectures in an intuitive and engaging manner.",
                "Professor Ng wrought lecture notes that were extremely helpful",
                "Professor Ng's personal notes were so helpful for reviewing the material he covered in class.",
                "Professor Ng’s online notes were so incredibly helpful. They helped me study or review the material when working on the homework.",
                "Clarity of lectures, notes",
                "Willingness to ask and answer questions, strong knowledge of the subject",
                "Seeing Prof Ng work through problems in class helped me better analyze and solve problems on hws and exams. Seriously go to lectures they're great. I'm amazed that a significant portion of the class just stopped showing up around week 5."
            ],
            "What could the instructor modify to help you learn more?": [
                "Having some smaller assignments to practice programming on our own without the pressure of homework would be helpful; also, discussion sections with more focus on concepts.",
                "I wish instructors could go over homework or present similar problems, but I get that it could be an issue due to homework resubmissions.",
                "I think he was a little condescending when it came to basic questions; I feel like this course was not beginner–friendly",
                "I think slides might be more beneficial or just a way we can keep track on what has gone on in the class so we're less likely to get lost.",
                "go through more exam style questions in lecture",
                "Try to make the screen bigger and lighter so that it is clearer to see what's written on it.",
                "The linux system screened in class have a white background, which makes the code very hard to see. Instructors might want to consider adjusting the screen they show during class just so that students can actually see the screen.",
                "nothing",
                "I think he could go over simpler topics faster and spend more time on examples for the harder sections.",
                "n/a",
                "Provide readings from the textbook that correspond with lecture material.",
                "It’s not a deal breaker, and I do believe it’s nice that he does so, but perhaps avoiding answering too many questions in class. Talking with peers of other sections, I learned that some days we were slightly behind or didn’t learn everything because questions took up time. Perhaps if the question is too complicated to answer, you could redirect students to talk to you after class or email you but again this is a minor inconvenience. It’s great that you really help us understand!",
                "could have helped us understand better what was on the exam",
                "I would have appreciated a homework/project that explicitly used trees/binary search trees. We spent quite a long time covering these in lecture and were expected to know how to use them for the final, but we didn't ever really have any practice problems on them besides a few during discussion sections. A more robust tree/bst problem would help.",
                "I wish the course itself covered the very very basics in class for those students that have never taken CS before. I felt very left out of discussions despite attending most of the lectures."
            ],
            "Please include the name of the TA/CA/Intern you are evaluating. What aspects of the TA's teaching contributed most to your learning? What could the TA modify to help you learn more? Please include any additional feedback for the TA/CA/Intern.": [
                "Olivia Campili",
                "Zhe Heng Eng; was helpful in discussion sections, but the way the discussions were structured by the course (not the TA's fault) made it difficult to really collaborate in the amount of time provided.",
                "Zhe Heng Eng brought up student responses to the discussion section problems and pointed out key ideas that the student should understand.",
                "My TA was JunHyuk Chang. He was a fine TA, but I feel that the whole group discussions fell a little short.",
                "Zoa. She was actually really helpful, I wish we had more discussion sections",
                "Lily Ehsani: She was a great TA! She really helped during discussion sections and helped me understand concepts in class a lot more.",
                "Anne Rogers",
                "Zhe Heng Eng",
                "William! He was great",
                "Park was pleasant and helpful in the discussion sections.",
                "zoa is so sweet and fun. i felt like i could actually learn with her.",
                "His first name was Will, but he was a great TA. He always pushed us and would provide great guidance during our discussions. He never made anyone feel bad for struggling or not understanding a topic. Instead, he would encourage people to come to the answer themselves with adequate “pushes”, so once they finally come to the answer they’re able to feel accomplished.",
                "Zhe was very helpful and responsive; his discussion sections taught me a great deal and were very engaging.",
                "Discussion sections were helpful. But the manager/recorder/speaker format seemed kind of useless."
            ],
            "Other course elements not mentioned above:": [
                "Discussions sessions",
                "The discussions are super beneficial!",
                "Discussion",
                "Discussion Sections"
            ],
            "Please comment on the level of difficulty of the course relative to your background and experience.": [
                "With several years of introductory programming experience, the workload was challenging due to the amount of work, less so the actual difficulty",
                "I found it progressively more difficult, in terms of the homework. However, it could also be my lack of coding experience that made it that much more difficult.",
                "This class can be difficult, but there are a lot of ways to get support.",
                "relatively difficult for someone without coding experience",
                "It is an introducotry course for students who do not have prior experience in computer science.",
                "In my opinion slightly easier than other intro sequences such as the math 160s and physics 140s",
                "For beginners, it's possible to get an A– in this class by devoting 20+h/week. Whether you get an A or not is less predictable.",
                "I have a decent coding background, and some assignments were still very thought provoking and interesting.",
                "No coding experience. The course was extremely difficult but very do–able with sufficient effort.",
                "Do not recommend for someone with no coding experience, you will struggle.",
                "super duper difficult i would have failed if i had done it on my own",
                "As someone with no coding experience, it was definitely challenging but not impossible. This class will require you to study, and if you’re ever stuck or confused never be afraid to reach out or ask for help to either the professors, TAs, or people at CSIL.",
                "I didn't have any experience and found the grading scale and exam structure to be excessively challenging due to the pressure of only 1 or 2 problems per subject"
            ]
        }
    },
    "2": {
        "course-section": "CMSC 15100 1",
        "instructors": "Timothy Ng",
        "quarter": "(2208) Autumn 2020",
        "comments": {
            "What are the most important things that you learned in this course? Please reflect on the knowledge and skills you gained.": [
                "I have learned how to construct, navigate, and manipulate important and consequential data structures, analyze various aspects of code, including debugging and optimization, and build interactive computer programs.",
                "Learning to debug my own code",
                "Programming in Dr. Racket, universe programming, recursions, lists, trees.",
                "recursive thinking, coding and testing techniques",
                "\bRecursion.",
                "Learning how to think critically",
                "Recursion as a fundamental concept",
                "Logic––thinking through challenging problems step by step.",
                "How to recursively code, how to even begin to process the skill of coding, how to think like a programmer",
                "Learned a functional language and the basics of computer science.",
                "How to program",
                "There are many things but in general, I would say that we learned how to think like Computer Scientists rather than just saying we learned how to code (we did plenty of programming don't get me wrong, but the method behind was equally if not more important which will serve in the future).",
                "recursion",
                "– Coding logic",
                "– recursion",
                "– trees, lists, sorting",
                "Basics of coding",
                "Data structures, recursion.",
                "Recursion and helpful programming practices",
                "Recursion, lists, trees, graphs",
                "recursion, tools to make computation in racket easier, lambda stuff, higher–order programming, polymorphisms, and some other things",
                "We learned how to program in Racket. We covered recursion, dealing with images, and ultimately creating graphs and universes.",
                "I learned how to code in Racket. I learned a lot of recursive function programming and very minimal theory.",
                "The basics of computer programing thinking.",
                "Dr. Racket, basic algorithms",
                "Functional programming",
                "Recursion and good habits for writing code.",
                "Basics of functional programming, Racket, pattern matching/mapping/folding and different ways to deal with different data structures",
                "Typed Racket and many fundamental coding skills such as understanding recursion, sorting, and efficiency"
            ],
            "Describe how aspects of this course (lectures, discussions, labs, assignments, etc.) contributed to your learning.": [
                "The videos were very helpful in explaining concepts in depth, especially since professors did not merely show previously coded programs, but worked through them live. In addition, the background behind individual decisions was explicated in depth. In addition, lab assignments, homework assignments, and projects were all very helpful in reinforcing concepts and enjoyable, producing tangible and interesting results.",
                "hw assignments and labs were helpful in practical application of lessons. the final project also gave us practice with writing large code from scratch",
                "The recorded videos were great but I felt that sometimes the assignments were too difficult for what was thought in the videos. We sometimes had to do our own research.",
                "weekly lab sessions/discussions with peers helped cement understanding gained from lectures",
                "The labs and assignments were extremely useful for me to digest the lecture materials.",
                "lectures, labs, and homeworks",
                "Lectures (which were virtual) presented the content and the assignments helped me practice and learn.",
                "Giving us a basic example of how a concept works and then having to do it hands on in projects and labs helped cement the ideas",
                "Asynchronous allowed for me to access course materials easily.",
                "the videos",
                "Lectures where a great contributor to learning and since we had the lectures in video format, we could always rewind and watch videos if we forgot a topic or just wanted to review. However, the labs, homework, and project where by far what most contributed as you actually put your skills to the test.",
                "the labs provided a great opportunity to learn and clear up any confusion on the assignment.",
                "Lectures were easy to follow and informative. Labs were not that useful since we only had 30 mins to discuss assignments and it was never enough time to get through much. The assignments were challenging but rewarding and fun.",
                "You learn the most through the practice you do in labs and homework, less so just from examples covered in lectures",
                "Recorded videos introduced concepts for the course, while the assignments allowed me to put those concepts into practice and reinforce my understanding.",
                "The asynchronous videos were very interesting and helpful. The instructors regularly answered questions on Piazza. The assignments were reasonable and interesting.",
                "labs were helpful, lectures were great",
                "lectures were super helpful; shaw and ng's explanations made a lot of sense and they broke down concepts very well. assignments were kinda hard and a lot but definitely forced me to learn the concepts",
                "Lectures were pre–recorded, concise, and very helpful. The problem sets could take a while to complete but were interesting. Labs were similar to problem sets.",
                "Professor Shaw's lectures were very engaging and enjoyable, while Professor Ng's were less engaging but very informative.",
                "The lectures laid out the basic principles and labs and homeworks allowed for student to practice them",
                "Video lectures that I can watch repetitively if I want to, weekly labs and homeworks were also very helpful",
                "The lectures were very good. The labs and assignments could get tedious, but at the end of the day, it really solidified my knolwedge.",
                "The videos were very well made and explained concepts well.",
                "All the lectures were asynchronous which was helpful in that we could complete them in our own time (but also required planning ahead and staying on top of them. Lab sessions were somewhat helpful, but because lectures were asynchronous, people usually hadn't watched the videos before coming to lab, so we didn't get too much done. The review session \"labs\" before exams were helpful though.",
                "I loved everything about this course. The video lectures were extremely entertaining and the projects were fun to complete."
            ],
            "What aspect of the instructor's teaching contributed most to your learning?": [
                "Engaging and entertaining videos and assignments, clear expectations, and availability.",
                "His notes next to the videos were pretty good",
                "well–made lectures and lecture notes if available",
                "The instructor made very good and clear videos as lectures.",
                "The lectures",
                "Shaw sometimes took the effort to make his lectures more entertaining by adding humorous effects or anecdotes which I appreciated. Ng's notes that he made for each of his lectures were really helpful in clearly outlining the concepts he covered. Shaw and Ng were both extremely well–versed in the syntax of Racket which was helpful for questions during office–hours.",
                "Both of my teacher's abilities to explain concepts in more than one way",
                "He was willing to answer any questions",
                "Teaching",
                "The lecturers and accesability to answer questions on Piazza where very helpful.",
                "The lectures",
                "Realtime Piazza responses and helpful lecture videos.",
                "Very helpful in office hours",
                "The online video and assignment format actually worked extremely well for a computer science course. I could reference the corresponding video whenever I needed syntactic clarification on specific functions or a refresher when completing an assignment.",
                "The videos were very detailed and easy to follow.",
                "quick and helpful responses to questions on piazza",
                "Shaw and Ng's lectures were all very well explained and thought out, and I appreciate that they walked us through both concepts and examples during them. They were also quite helpful during labs",
                "Professor Ng's explanations in lecture were very clear and he was always helpful in our lag section.",
                "Professor Shaw's enthusiasm and visual gags were very engaging and made lectures both informative and entertaining.",
                "The instructor was very often available to answer questions about labs and homeworks",
                "He provided class notes alongside the video. He uses many examples and finally he is always willing to answer all of our questions",
                "The labs and assignments",
                "The way the concepts were explained in the videos helped.",
                "The instructors responded quickly to questions on Piazza and lab sessions/review sessions where we interacted with them live were helpful (both Prof. Ng and Prof. Shaw are great at explaining concepts in clear ways). The lecture videos were also very clear. However, I felt like without having that much \"live\" interaction, I wasn't able to get as much out of this class as I could have",
                "Piazza served as a really great platform for us to interact with the Professors (Ng and Shaw) as well as other classmates. Everything was really well organized and the professors/TA's were always able to answer our questions quickly."
            ],
            "What could the instructor modify to help you learn more?": [
                "I think that the fact that the exam precluded use of actual code was slightly misguided, since it is a normal part of the programming process to debug code and solve minor errors, which was impossible in the given format. On the other hand, I understand that the exam has previously been given on paper, and that the underlying concepts are easier to test if code correction is not available.",
                "Maybe more examples in a similar difficulty than what is expected in exams and homework.",
                "more quizzes?",
                "The instructor could tell us more about what the exams would expect from us beforehand.",
                "More engagement with other students",
                "Putting an exam the week before finals with a project due on the same day is very stressful and a little overkill",
                "Grant a few extensions that we can use as needed throughout the quarter.",
                "More instruction in real time",
                "Be more available and respond to emails.",
                "I don't think that there is much that I would change as I would fear that it would mess up the balance there currently exists. If anything, maybe quicker returns on Assignments but I am aware there are many students in the class and it's a lot of code to go through.",
                "n/a",
                "Reduce the course load / make the exam more conducive to slower programmers (coding without so much time pressure perhaps).",
                "I wish there was a way to speed up lectures, so that it's easier to go back and study from them",
                "N/A",
                "Nothing",
                "non",
                "Nothing really.",
                "I think the grading could be a little more generous in general when the general idea is there, but a slight error is made.",
                "The fact that the class took place on piazza was irregular and inconsistent with other classes, making it inconvenient to access",
                "nothing",
                "Dr. Ng could publish his notes for the topics Shaw covered.",
                "Have the lab sessions have more purpose.",
                "Finding a way to make lab sessions more productive (ex: requiring people to watch videos beforehand?) or using the lab sessions for review or general working time instead",
                "N/A – this was an amazing class"
            ],
            "Please elaborate on the above.": [
                "The only element I found ineffective was the laboratory assignment discussions, since I think that it is difficult to garner any meaningful feedback from peers when code is not visible to each other and when each individual is starting the assignment during the period. In fact, I have yet to experience such a 'discussion' in which students have actually discussed anything! I think that the intention is very admirable, but I didn't find this element of the course particularly helpful.",
                "It was often difficult to seek assistance for specific problems, but overall the labs and hw were very relevant. Fundamentally, timed exams are not a good format for computer science.",
                "I hope we had more synchronous lectures (we had none) where the professor would make a global revision of an exam or assignment",
                "Learning mostly through asynchronous videos, were effective and instructors communicated in a number of different ways",
                "The assignments (combo of labs and hw) are what actually helped me learn the material by trying it on my own. The lecture videos are obviously necessary to develop an understanding of what the concepts are. The exams I feel would be better replaced by additional untimed assignments. I don't think timed exams are a good metric for evaluation.",
                "The whole course was asynchronous, and I didn't have any issues with it. We had weekly labs, and weekly homework. Office hours were always available",
                "Labs, at least on zoom, didn't really amount to much collaboration. Groups often just worked by themselves instead of with each other.",
                "As mentioned before, the assignments where extremely effective as this put the skills to practice.",
                "The profs provided a great opportunity to learn.",
                "I wish there was more time for the exams they were very long and I can't think that fast :(",
                "I did not use office hours or ask any questions on piazza, but it seemed like the instructors and TAs were very quick to respond to questions on the platform.",
                "The asynchronous videos and lab meetings were very helpful.",
                "Using piazza worked out well",
                "didn't go to office hours, but the double assignments per week definitely made you learn the content (sometimes because of sheer volume)",
                "The exams were pretty standard. Problem sets and labs were difficult but appropriate for understanding and internalizing the material",
                "The asynchronous lectures were good, but lab sessions were not very helpful for me.",
                "The lectures were solely asynchronous. This gave flexibility, but I also feel that the lack of regular structure outside of lab times made learning difficult",
                "The lab sessions didn't seem to be super helpful.",
                "Office hours with faculty were one–on–one, which I didn't realize until later (I was in the waiting room for an office hour for a while without getting in, and so eventually I left without meeting with the professor, which was disappointing). Maybe making this more clear, or having more group office hours, could be helpful. The written work was effective in challenging us, although at the beginning, it was a bit too fast paced. Also, typing code in Gradescope for the exams was a bit annoying (with indenting)"
            ],
            "Did the instructor make adjustments to the course mid-quarter? If so, please comment on the effectiveness of those adjustments.": [
                "I don't believe so.",
                "He used the labs as office hours which was helpful near the end",
                "no",
                "No",
                "No",
                "no",
                "There where no adjustments made mid–quarter.",
                "No",
                "No adjustments were made",
                "No",
                "no",
                "no",
                "No.",
                "No major adjustments",
                "No",
                "Reduced the number of labs/homeworks due, which was very helpful (because we would've had a lab, homework, and midterm or another big project/lab due in one week)."
            ],
            "Please describe any element of this course, including specific actions by the instructor, that improved your remote learning experience.": [
                "Asynchronous lectures were very helpful, in addition to engaging and entertaining assignments which effectively reinforced material and introduced new concepts.",
                "Just",
                "Piazza definitely helped to make up for the lack of in person interactions.",
                "sufficient office hours",
                "The recorded videos were very helpful.",
                "Office hours",
                "Asynchronous lectures.",
                "The asynchronous lectures being very easy to understand and also being put up in a flexible and timely manner (no hard hour when the videos where released but it was always on a Monday, Wednesday, and Friday).",
                "The intro music was pretty nice.",
                "The prerecorded videos.",
                "The ability to ask questions under each assignment and have them answered quickly",
                "homework and labs were great",
                "The pre–recorded lectures were very helpful and often even enjoyable to watch. They were concise too which made them a lot less intimidating to watch then perhaps a 90 minute lecture for another course.",
                "Instructors every quickly answered questions that students had and made those answers available to others with similar issues",
                "The office hours that were available were very helpful.",
                "Having lab sessions be live review sessions, and letting people attend any/as many lab sessions as they wanted"
            ],
            "What aspects of the TA's teaching contributed most to your learning?": [
                "their office hours were very helpful"
            ],
            "What could the TA modify to help you learn more?": [
                "more office hours scheduled around evening bc in the day time it's hard to find an available time to participate"
            ]
        }
    },
    "3": {
        "course-section": "CMSC 15100 2",
        "instructors": "Timothy Ng",
        "quarter": "(2208) Autumn 2020",
        "comments": {
            "What are the most important things that you learned in this course? Please reflect on the knowledge and skills you gained.": [
                "DrRacket; got very familiar with recursive functions by the end.",
                "The fundamentals of computer science, recursion, lists, and trees, and how to program in racket.",
                "How to design programs and how to think computationally.",
                "Basics of programming and it really helped me refine how I thought about writing programs",
                "Above all, I learned how to code in Racket! I learned the different components of code, how to write code to accomplish code, how to iterate, debug, and test for errors, and how to organize code to decrease verbosity. I learned about recursion, displaying images, the functions foldr, map, and filter, how to work with lists and data, and how to make intractable programs (visually and by typing commands).",
                "recursion, binary (search) trees. linked–lists, local variables, pattern matching, lambda functions, universe programming (UI)",
                "All about racket, some beginning principles of computer science",
                "how to write simple programs with DrRacket",
                "The most important thing we've learned in this course is probably the list functions and binary (search) tree.",
                "Recursion and practical computer science programming skills (from our project assignment = create an interactive crossword).",
                "Racket and laying the foundation of good programming",
                "Relearned a lot of skills that I have not used in a while. All things considered, the most important thing I learned was in the second half of the course where things became more cohesive and began to build on each other and it is becoming clear that vectors are going to be important moving forward into future courses.",
                "I learned how to program in Racket, including recursion in lists and trees, images in Racket, and polymorphism.",
                "Skills relating to data and how to think big picture with computer science.",
                "Recursion, pattern matching, binary search trees, lists, graphs, etc",
                "Understand how compilers understand code and how to use recursion.",
                "recursive programming",
                "Having never programmed before, I would say learning to program. But more seriously I feel as though the introduction to graphs and the focus on lambda functions will be important in the future.",
                "basic programming; cs concepts",
                "Racket programming, recursion, data structures like binary trees and lists (a little bit of graphs at the end), lambda expressions, sort and search algorithms, polymorphism and higher order programming, etc.",
                "More largely, the basics of computer science/ programming. In terms of specific topics, recursion and higher order programming.",
                "– coding with the language racket",
                "– understand basis of code performance (why some code is more efficient than others)",
                "Recursion",
                "Racket programming; basics of computer science",
                "The basics of programming, especially recursion and stuff like that",
                "I learned the importance of actually having a plan before I start coding, and to make sure to have a legible structure to what I write.",
                "Learning recursive thought processes",
                "This course has introduced me to the basics of computer programming and was able to explain me the details of several algorithms. I got to practice all of the new coding skills that I have learned almost immediately though homework and lab assignments.",
                "I learned how to think like a computer scientist– the logic that goes behind the construction of functional languages",
                "The basics of functional programming using racket."
            ],
            "Describe how aspects of this course (lectures, discussions, labs, assignments, etc.) contributed to your learning.": [
                "Every week there is one assignment and one lab, which was relevant to the coursework we learned that week.",
                "Prerecorded lectures were very informative and succinct. The lab times helped get a start on the assignments by discussing with peers on how to write the program. Labs and homeworks really applied the concepts covered in the lectures and were useful for practicing the concept and writing the codes.",
                "The lectures were decent, but the most learning happened through the Lab and Homework assignments. The assignments allowed us to clarify our misconceptions.",
                "the lectures were good and Professor Shaw made them really fun. Office hours were really helpful.",
                "I think the projects, labs, and homework assignments accelerated my understanding of the course material and application in programming. Since the questions were always difficult and long, I spent lots of time trying to figure things out, testing different methods and such, which was difficult but overall improved my knowledge vastly. I feel like the lectures only helped me sometimes– my focus for them wavered based on whatever work I had that day. Sometimes I could focus on them, but most of the time I would forget the material.",
                "The lectures were important for learning the basics of a concept, but the real learning came in doing labs and homework. These exercises were very well thought out.",
                "The labs and homework for this class are very helpful for getting a hang of racket",
                "all of them are very helpful, to me having labs and assignments to practice what I learned is the most important.",
                "The pre–recorded lectures are all very informative. The discussions on Piazza helped to address some questions students have. The lab session stimulates peer discussion. The assignments are closely related to the course material taught in the lectures.",
                "Pre–recorded lectures delivered all course content. Weekly labs (30 minutes) were not very useful: they're meant to help students start on homework assignments but you get assigned with random classmates and often times no one has finished the lectures from the day before and so we're all just idling away (don't know how to do the lab). Prof. Ng is very good as answering questions in office hours though.",
                "It was almost all asynchronous except labs, which was helpful because I could watch lectures whenever I had the time, but it also made me tend to get behind more easily",
                "Lectures that covered fundamentals and topics outside of the asynchronous videos posted were contributed greatly to how I understood the reasoning behind doing certain things that were not covered or at least fully explored in the notes or book.",
                "",
                "Problem sets and the book we are studying from itself also helped provide a lot of aid to my learning. Going through the homework with the book and notes to help guide any further notetaking was also a large part of my learning.",
                "I thought the lectures were extremely effective and the homework/labs were well paced and helpful in grasping the lecture concepts.",
                "The lectures were obviously important but I learned the most when doing the labs/assignments. I like the frequency of them as it makes sure you don't fall too far behind.",
                "Lectures were very succinct, labs were very good length and the assignments were very helpful for application of lecture material",
                "Although lectures were pre–recorded, they were effective in conveying how to write code. Assignments were not just busy work, but quite useful in gaining an understanding of the language.",
                "Completing the entirety of the labs, homeworks, and projects was essential to succeeding in the course and learning the material.",
                "labs & assignments, piazza q&a",
                "The lecture videos on piazza this quarter were spectacular. Professor Ng and Professor Shaw teamed up to produce some of the most informative and helpful lecture videos I have ever watched. Even though this was a remote quarter, this course adjusted incredibly well. While I didn't have the opportunity to interact with the professors in real time during lectures, it was helpful to be able to pause the video to take notes, or rewatch parts of the videos for clarity. Professor Ng's notes on the lectures are also really helpful for studying for exams. Homeworks and lab exercises were helpful as they allowed me to practice what was covered in the lectures and implement cs concepts in code. I came into this course with no background in CS except an online course I took at my own pace the summer before. The assignments were just at the right level of challenging and fun for me. The final project was harder than the lab and homeworks but not unreasonable. As long as you give yourself enough time and dedicate enough thought to it, the outcome will be good.",
                "Lectures were super informative and useful.",
                "There were no discussions really because every lecture was asynchronous.",
                "Labs themselves were good practice and thus a contributor to learning, but lab periods were a waste of time.",
                "Homework was also good practice and thus helped a lot with my learning.",
                "– weekly homework and lab assignments gave me hands–on work that allowed me to understand the material better by applying it",
                "– the pre–recorded lectures were a really good way of doing this course because it let me learn on my own time and rewatch anything I didn't understand",
                "The homework and lab assignments were helpful in making us apply and continue to apply skills we were taught in lecture",
                "The labs and homework assignments were helpful",
                "Lectures were helpful",
                "Had asynchronous videos to watch every Monday, Wed, Fri.",
                "Labs on Wednesday that went over our lab due Thurdsay (essentially just another homework)",
                "Homework due Tuesday",
                "Could ask questions on Piazza",
                "Assignments that I struggled on really forced me to take a breath, pick up a piece of paper, and figure out what I wanted to do with the code, rather than just trying to force my way to success.",
                "Labs and homework were good ways to put my learning into practice",
                "This course has really improved my problem–solving abilities, since I had to put a lot of thought into my code in the labs or homework assignments before writing it and had to think through my algorithms, sometimes using paper and pencil. This focus on my problem–solving abilities has helped me in some of my other courses, too, giving me the skill to look at a problem from many different angles to determine the most optimal solution.",
                "The homeworks/labs were really useful because I could have hands–on practice with actual code",
                "The lectures were where all the concepts were taught. They were all pre–recorded lectures that were very clear and helpful. The homework was where we would get to practice using the concepts presented in the lectures, and was helpful in learning the material. The labs where like harder versions of the homework and were also very useful."
            ],
            "What aspect of the instructor's teaching contributed most to your learning?": [
                "Asynchronous lectures",
                "Both Professor Ng and Professor Shaw explained the concepts very well in lectures and were helpful with responding to issues and questions on Piazza.",
                "Professor Ng was very helpful on Piazza. The lectures were moderately helpful, although due to the nature of the subject, I don't believe this was Professor Ng's fault.",
                "Professor's Shaw friendliness and kindness really helped me in the course. It was evident that he really cared about each student's learning and was extremely approachable",
                "For one, having Piazza increased my connection with the instructors drastically. Since we could post questions and get fairly fast responses from them, it made me feel supported and expedited the process of tackling the assignments. They gave good feedback, trying not to \"spoil\" the answer to a problem, but tailoring the detail of their response to how much trouble the student was having on the assignment. The instructors also gave us los of encouragement when things got tough, which motivated me a lot when I was feeling like I wouldn't be able to do well/finish the class.",
                "Both Professor Ng and Shaw were always very quick and good about responding to students' questions.",
                "I really appreciated Ng's notes! They were great to reference as you started coding without having to rewatch the entire lecture.",
                "demonstrating with real codes while teaching",
                "Lectures and office hours.",
                "With remote, we got to see lectures from both Professor Ng and Professor Shaw, which was really nice and helpful because we had 2 professors instead of one",
                "I think aspects that contributed to my learning definitely came in during the second half of the course but just having lectures to explain some nuances and reasoning behind some of the techniques being employed was really useful. The lectures were really easy to follow and provided a lot more notes that I could markup and use as a guide for how to approach the material.",
                "The professors' availability outside of class (office hours, labs) contributed most to my learning since they were able to answer any questions I had about concepts.",
                "I liked the lectures as they were very very clear.",
                "Lectures",
                "Their availability was a pleasant surprise, and they were always open and able to answer questions about the homework and coursework.",
                "– I really appreciated their willingness to answer questions",
                "q&a",
                "The lecture videos made by Professor Ng and Professor Shaw were incredible. They're usually 10–20 minutes in length so they never felt too long. Professor Shaw's lectures were often humorous and he explained the concepts in a fun and engaging way. He even wrote music for the intros! Professor Ng's lectures were also engaging and well–structured. His notes on the lectures were very helpful for studying for exams. Both professors were also very accessible on piazza. Sometimes they would answer my questions almost immediately even when I posted at 10 pm. On another note, Professor Shaw's video \"Am I Cut Out For This\" that addressed imposter syndrome was super helpful and motivating. More CS professors should address this as this is something that a lot of people new to CS, especially minorities, struggle with. Professor Ng and Shaw are truly wonderful professors who really care about their students!!!",
                "Lectures were the most information heavy, so they contributed most. Clarifying some issues I had with topics discussed in lecture during office hours was also very helpful.",
                "– the lectures were very interesting, short and seperated into multiple videos, well explained, and thorough",
                "– provided a rich understanding into the basis of any topic explained",
                "The videos were entertaining and helpful",
                "Lecture videos and notes",
                "Videos and question answers",
                "I feel like the instructor answering Piazza questions are what helped me the most to understand what was happening, along with lecture notes being very helpful.",
                "Piazza was a good resource throughout the year",
                "Professor Ng always tried to make the material as accessible to us as possible, making detailed notes for every lecture video he recorded to make review and understanding easier. He was always helpful during office hours and lab sections, not actually giving any straight answers to my problems, but giving me a direction in which to approach my problem, prompting me to solve it myself.",
                "Probably their piazza posts– there was a lot of helpful information I gleaned from those",
                "The rather quick responses to questions on piazza were really helpful."
            ],
            "What could the instructor modify to help you learn more?": [
                "Professor Ng can make the lectures more interactive or fun because sometimes it became a bit monotonous and boring.",
                "Nothing, it was a great course!",
                "Asynchronous lectures were quite hard to keep up with. Finding time to watch the videos was more difficult as I was living off campus (as an international student). The syllabus for the midterm was just a list of topics, and the questions asked on the midterm were completely different to what we had been accustomed to. Essentially, there were significantly more knowledge based and conceptual questions, but all of our assignments so far had been problem solving. This made studying for the midterm very confusing. Also, the amount of time given for the midterm was low relative to the length and number of questions.",
                "Maybe more office hours and quicker grading if possible (but I know there were a lot of students in the course so that was difficult)",
                "It'd be nice to have notes to consult before every lecture–video. I found that I retained information from Prof. Ng's lectures more because I read the notes before and saw the video. I think that linking notes to Prof. Shaw's videos would have a similar benefit. If there were a couple practice problems interspersed throughout the videos, I'd find them much more engaging as well.",
                "NA",
                "already amazing",
                "I think in some homework assignments, a clearer expectation of outcome can be provided to the students. For example, some test input and output data can help students to understand whether the program is running in the right way.",
                "Lectures are rather theoretical and abstract but entirely sufficient.",
                "Because mostly everything was asynchronous, it was easy to feel a bit disconnected to the course",
                "If possible have more of the lectures be more about explaining the content's exceptions or small things that could help when given a problem. I don't think people want to talk so early in the morning and it makes it hard to collaborate and get guidance from peers when no one wants to respond fully.",
                "They could return labs/tests in a more timely manner.",
                "Just the in person aspect would've been nice.",
                "Talk faster in lectures so we can cover more material",
                "For the current circumstances, the methods were quite effective. Assignments did take a somewhat significant time to be evaluated, and if they were returned slightly more quickly, it would've helped me understand parts of the lessons that I struggled with.",
                "– be more mindful about the amount of work they assigning, and how long labs/hw might take us",
                "no",
                "Nothing. They're the best.",
                "Instructor office hours were usually just there for the sake of completing an assignment or lab. Shaw once cancelled office hours and said he'd reinstate his once there was something due to talk about. If there was more opportunity to have sort of a conceptual check in office hours, I think that would be beneficial.",
                "nothing",
                "Knowing the homework assignments more in advance.",
                "Practice material for the two exams. We had no resources to practice with or improve our cs test taking skills.",
                "Personally, I just really dislike the asynchronous method of teaching course, because I have a hard time watching pre–recorded videos especially when I don't have a rigid schedule.",
                "Nothing",
                "It was a pleasure working with Professor Ng and Professor Shaw this quarter, and I wouldn't change anything in the way that they teach the course.",
                "Make the class synonymous– asynchronous lectures were not the best at explaining because I need that interaction but it was okay",
                "Nothing really. Maybe be a bit more creative with editing the lectures?"
            ],
            "Please elaborate on the above.": [
                "The professors made great use of the remote capabilities of the course and were very reachable. The breakout rooms during lab times were very effective for working with other students and also being able to request help from the professor.",
                "I chose these because of my aforementioned complaints with the midterm and asynchronous lectures.",
                "I felt that the the laboratories and written work were the most effective modes of remote teaching alongside our exams. At most, I wish the homework and laboratory assignments (mainly the labs) could be posted earlier so that we had more time to work on them. I think the exams were good challenges, but because we had so much work, I wasn't able to devote much time to correcting my mistakes. I think it would be cool if there was some time of optional extra credit that involved correcting some/all of the exam questions. I didn't attend office hours that often, but I found Prof. Shaw's the most helpful. There was not a lot of students there, so I could stick around working on assignments and ask questions if they came up. The one time I went to TA office hours, it was so full that I would struggle to interject my question.",
                "",
                "It'd be nice to have notes to consult before every lecture–video. I found that I retained information from Prof. Ng's lectures more because I read the notes before and saw the video. I think that linking notes to Prof. Shaw's videos would have a similar benefit. If there were a couple practice problems interspersed throughout the videos, I'd find them much more engaging as well. Having 1–3 practice problems associated with each lecture would've helped me retain more of the information as well.",
                "I love the synchronous lectures for this course, every key concept was explained in a very concise and comprehensive way",
                "Midterm was like hustle time: we had to type everything onlinei and it took a long time to check dumb stuff like identations and parentheses. Two assignments each week: a lab and a homework (both are coding assignments and pretty long –– expect to spend at least 3–4 hours on each, if you encounter no major errors). Office hours are really helpful. Many people also just post questions on Piazza about assignments and the professors as well as other students respond pretty quickly.",
                "While each individual aspect of the course was effective, all together turned out to be a lot of work",
                "I thought mostly everything in the course was effective except for the small discussion breakout rooms about the labs. There wasn't much participation and I think it pretty much functioned as a time to ask questions to the professor.",
                "I did not go to office hours.",
                "Small lab breakout rooms weren't helpful because not everyone has the same coding level",
                "There was not a lot of open discussions available outside of the weekly small lab sessions, but those were still assignment focused.",
                "instructors and TA answer questions really quick.",
                "The exams were helpful in terms of testing our understanding on the CS concepts, but it was weird writing code in plain text format. I can't think of any real world situation where I'll have to write code outside of a programming environment. For the midterm, I was penalized for some minor syntax mistakes that a compiler could have easily caught.",
                "There were no live lectures or group discussions, which I think wasn't the best choice. The few times we'd meet in small groups over Zoom for lab periods were usually silent and did nothing for any of us.",
                "All the labs, work, and exams were fine, and the TA office hours were great. CS151 has fantastic TAs (and core tutors).",
                "I felt I didn't gain anything from the lab because too many people finished the assignment before we met, even though it was supposed to be a time to work together on the first part of it.",
                "As I previously said, I disliked the asynchronous format, and instead felt like I did most of my learning hands on through home works and labs.",
                "Synchronous lab sessions could have been better but the lab assignment itself was good",
                "The asynchronous lectures constituted the biggest part of my learning in this class, since no synchronous lectures were offered this quarter. The lab assignments and homework were also very helpful to practice my newly learned skills in code right away, even though they were quite overwhelming sometimes and took a lot of time and effort. I would prefer if there was a greater synchronous component in the course, since learning completely asynchronously is quite difficult in terms of time management. I also think that the hw/lab assignments were a bit too time consuming at times, since we never got a break in between one week's lab and homework.",
                "the zoom office hours weren't the most helpful– I would say that the actual coding contributed most to my remote learning",
                "Labs and homework was where you spend the majority of your time for the class. The exams we had felt out of place. They forced you to memorize things rather than problem solve like the rest of the course."
            ],
            "Did the instructor make adjustments to the course mid-quarter? If so, please comment on the effectiveness of those adjustments.": [
                "No adjustments.",
                "The instructors were very willing to take our feedback into consideration and helpfully adjusted the deadlines for some assignments.",
                "The timing of the exams shifted slightly but that didn't effect anything too much",
                "They extended the due date for a lab later into the quarter and decreased the workload a bit to account for the increasing difficulty of labs. This was much appreciated, as between the assessments and the projects, the work escalated a lot towards the end of the quarter anyway.",
                "no adjustments needed",
                "No.",
                "Yes, the nature of the lectures and consideration of the midterm results helped shape the rest of the course and how material would be covered. Switching the style of lectures was great since it allowed me to add to my notes and comprehension of the material. I greatly benefited from this change since it suited my style of learning a lot more.",
                "No",
                "n/a",
                "Not really",
                "n/a",
                "N/A",
                "No.",
                "Not that I can think of.",
                "No",
                "No.",
                "No",
                "No, the course was the same all the way through."
            ],
            "Please describe any element of this course, including specific actions by the instructor, that improved your remote learning experience.": [
                "Office hours were helpful, timely responses to questions on Piazza, and excellent and engaging lectures (music, humor, and personable comments made the lectures interesting to watch!)",
                "Piazza was one of the most useful tools I've ever used.",
                "The kindness of both professors really made this course",
                "I really liked how Prof. Ng provided notes with his lecture videos. Since I don't always find videos engaging, previewing the videos with my notes improved my engagement.",
                "the instructor, for more than one time, went out of his way to make us feel emotionally supported",
                "Prof Shaw (other professor in the sequence) made a few fun/motivational videos and did cool video editing to make students feel less depressed. Prof Ng puts music in the beginning of his lectures too. Flexible with lab attendance and always posted lectures at consistent times (MWF mornings, before 10 AM).",
                "Using the piazza",
                "I thought the availability of office hours greatly improved my remote learning experience. The professors would often add office hours when there were large labs or projects due and it helped a lot.",
                "Piazza",
                "The lectures were fun to watch. The professors made the remote asynchronous videos seem very similar to a live lecture.",
                "longer time for the assignments",
                "Lecture videos were incredibly helpful. If I had questions about anything in the lecture videos, the professors were always accessible on piazza or office hours via zoom.",
                "The fact that there were so many TA office hour sections available was very helpful.",
                "Office hours and piazza question answers helped a lot",
                "I liked how Professor Shaw made an effort to liven up his videos.",
                "videos were useful",
                "The lecture videos by Professor Shaw were very helpful and also very fun and heartwarming, so I want to thank Prof. Shaw for providing me with weekly serotonin for the entire duration of this quarter.",
                "The creative lecture editing was fun and engaging. It made me look forward to watching the lectures."
            ],
            "Please include the name of the TA/CA/Intern you are evaluating.": [
                "henry liu",
                "Antonio Martinez"
            ],
            "What aspects of the TA's teaching contributed most to your learning?": [
                "q&a",
                "His office hours were great. He would explain to you clearly an issue you were having and check in repeatedly to make sure you were on the right track. If you came in being totally lost, he'd make sure you understood how to proceed by the time you left the Zoom."
            ],
            "What could the TA modify to help you learn more?": [
                "Nothing he was great",
                "n/a"
            ],
            "Additional feedback to the TA/CA/Intern:": [
                "n/a",
                "Thanks for being a super helpful TA and a positive introduction to computer science."
            ]
        }
    },
    "4": {
        "course-section": "CMSC 15100 2",
        "instructors": "Timothy Ng",
        "quarter": "(2218) Autumn 2021",
        "comments": {
            "What are the most important things that you learned in this course? Please reflect on the knowledge and skills you gained.": [
                "racket, functional language",
                "Functional programming experience, unit testing.",
                "Basics of functional programming, recursion, data structures",
                "I learned about the syntax for Dr. Racket, different data structures, recursive functions, and sorting methods.",
                "Recursion",
                "Basics of functional programming (e.g. recursion)",
                "I learned how to think logically, use the functional programming language: racket.",
                "Recursion and data types",
                "I feel like I am now familiar with the way computer languages work and will be able to learn other languages with ease.",
                "I learned how to use the language Dr Racket in a variety of contexts from search trees, simulations, etc.",
                "fundamental concepts in computer science and how to apply them to solve problems",
                "Recursion! Also universes/worlds and problem solving",
                "Coding in Typed Racket, structural and generative recursion, and program design",
                "As someone who came into this course with no knowledge. The most important aspects were the analytic problem solving abilities that I gained from learning Racket, along with the theoretical understanding of its inner workings.",
                "How to code in Racket and learning programming in general.",
                "computational problem solving and analytic thinking using a computer",
                "I learned how to",
                "How to program using Racket, and the basics of computer science",
                "learned how to program in Racket, fundamental tools of computer science and how to apply them",
                "Being able to think computationally in a weird abstract way.",
                "How to problem–solve and go about logically thinking about writing my code.",
                "Functional programming",
                "recursions,trees",
                "Basics of computer science with a big focus all types of recursive structures",
                "I learned how to code in Typed Racket, with many skills that will hopefully transfer to other functional programming languages and possibly imperative as well.",
                "How to think without the structure of error feedback, never had to do cs exams on paper and this challenge benefited me."
            ],
            "Describe how aspects of this course (lectures, discussions, labs, assignments, etc.) contributed to your learning.": [
                "everything",
                "the course plan is very clear and I learned from every material.",
                "Lectures are pretty slow paced, labs can be fun and often have more interesting problems, assignments were mostly pretty easy as well.",
                "Ed Discussion board very helpful for asking clarifying questions. Lectures engaging, assignments and labs very helpful in giving experience with the material.",
                "The lectures were helpful in giving informations, labs were helpful to put them to use while also getting help, and assignments put everything to the test; it was all helpful, but overwhelming in quantity and difficulty sometimes.",
                "Labs and homework assignments allowed for a better practical understanding of how to implement concepts learned in class.",
                "Both lectures and labs were well designed and helpful.",
                "Lectures were a good source for me to get introduced to topics, but the labs and hw helped solidify my understanding.",
                "The homework and lectures were very informative. The labs were not as much, but they were good practice I guess.",
                "The lectures were quite difficult for me to follow at times. I attended them for the first few weeks and always felt like I was behind. I had no computer science experience before this course and I assumed it would start from the very beginning, but on the first day the professor was already discussing things that I didn't know. It felt like the class was designed for students who were already somewhat familiar with computer science even though it was advertised otherwise.",
                "Labs help the most, lectures are fine but not very geared towards the homework",
                "the lectures and lecture notes contributed most to my learning.",
                "Labs helped get familiar with the act of coding, lectures helped explain concepts, HW and projects helped see these things happen altogether",
                "Lectures covered concepts in abstract, assignments and labs had us apply these concepts.",
                "lectures were interesting and informative, labs were difficult but fair along with the homeworks and final project.",
                "The lectures got the foundational ideas across while the labs and assignments were where we actually learnt to code.",
                "Labs and assignments are critically to learning the material, as any computer science course should be at least somewhat self–directed.",
                "Assignments were sometimes difficult",
                "Lectures were very informative, and the labs helped to reinforce concepts taught in class.",
                "lectures were not very helpful and I mainly learned from the notes published after, labs were helpful",
                "Lectures and lecture notes were super helpful, reading ED discussion is essential.",
                "The lecture notes that he posts were really helpful.",
                "The balance between lectures and labs and homework was great, albeit challenging",
                "His lecture notes were extremely helpful",
                "The labs and homework were especially helpful in understanding the topics taught during the lectures",
                "Labs were definitely the most helpful!!",
                "Assignments, and labs... projects not so much."
            ],
            "Additional comments about the course:": [
                "If you have any previous background with algorithms it is worth taking 161 instead. This class is very easy if you are already familiar with things like trees, linked lists, etc.",
                "N/A",
                "Functional programming is pretty weird to learn if you have background in imperative programming –– there are no loops or objects which is somewhat difficult to adapt to.",
                "Definitely a lot of workload.",
                "I wish the class had been more accessible to students who had no prior knowledge of the subject.",
                "n/a",
                "Professor Ng is fantastic!!",
                "For people not planning on taking further Computer Science and looking for a practical class, CS121 (Python) is probably a better place to start, since you can switch into 152 (C)",
                "The notes posted online were EXTREMELY HELPFUL, cannot stress this enough.",
                "good class. I had zero programming experience and got an A so dont feel discouraged from taking this class by a lack of experience",
                "I don't like check–expects :("
            ],
            "Thinking about your time in the class, what aspect of the instructor's teaching contributed most to your learning?": [
                "lectures",
                "Posting lectures notes online was very helpful.",
                "Asks questions to keep the class engaged, also is very receptive to questions himself",
                "Professor Ng's lectures and explanations on the board were always helpful. Him working through code and algorithms was especially good.",
                "The coding examples given during lectures.",
                "Lectures",
                "Quite methodological",
                "His explanations of algorithms",
                "I liked the way he explained concepts in lecture. Very clear and helpful.",
                "Never went too fast and always paused for questions",
                "Tim was a decent lecturer who had a broadly mathematical style that was reminiscent of a proof–based class in terms of how he deconstructed concepts.",
                "I liked how we would often start with a problem and think about how we would implement a solution mathematically before we tried to actually code our solution",
                "The online notes were very helpful",
                "His lectures were very engaging and helpful at explaining the conceptual basis of the technical work we were doing.",
                "The lecture notes posted for every class session, were very helpful for reviewing content that we had learned.",
                "The lecture notes published afterwards were extremely good summaries of what we learned",
                "Well organized lectures",
                "Professor Ng was great. He organized class well, was open to questions, and posted notes that were thorough and very helpful. Ed Discussion was also very useful in terms of questions",
                "Answering questions in class",
                "Lecture notes and office hours",
                "Office hours were available and helpful",
                "Office hours definitely contributed most to my learning.",
                "Lecture notes, and lab time."
            ],
            "What could the instructor modify to help you learn more?": [
                "none",
                "Maybe some optional harder material that goes more in depth into some of the ideas expressed in the class.",
                "N/A",
                "The instructor could make the lectures a little more engaging – it was easy to zone out.",
                "More specific instruction for content covered in labs during the actual lectures.",
                "Work on the pacing, it’s a bit fast at times.",
                "Nothing",
                "I wish the basic topics and function definitions at the beginning of the course were explained in much more detail.",
                "It was difficult to see the blackboard in the lecture videos. The camera should somehow be placed closer.",
                "N/A, Prof. Ng did a fantastic job",
                "I think past a certain point, waiting for the class to respond to a posed question is a waste of time. Shaw delivered one lecture, which I found to be much faster since it didn't rely on audience interaction nearly as much",
                "More weekend office hours! seeing as that is when most of the work for the homeworks was done.",
                "He asks a lot of easy questions to the class while he is lecturing (ostensibly to keep us engaged) but sometimes, they're so simple that its just wasting time. save this technique for the crux of problems, difficult steps, etc.",
                "share the code that he is typing with us beforehand or during to understand and see better",
                "More interactive work",
                "Going over concepts more in depth in class. I felt like I relied on his lecture notes to teach myself everything.",
                "Assign optional labs in the last two weeks of the quarter. The concepts taught near the end such as vectors and graphs were overwhelming to learn without these guided assignments.",
                "I really wish we had more in class work time. On the last day of class, we worked on our project and it was very helpful. It would just be nice to practice what we're learning for at least half a class period on Fridays, for example, in a setting that's not lab. I guess I just had trouble relating content to homework because of the difference between the pace of the class and the content on the homework.",
                "Perhaps fewer emphasis on the projects... or if continuing to use projects, ensure they use course relevant topics rather than be more difficult increments of earlier topics."
            ],
            "What aspects of the TA's teaching contributed most to your learning?": [
                "lab",
                "Responded helpfully to individual questions in labs",
                "The TA was very specific in answering questions and explaining concepts.",
                "Answering questions during labs",
                "Quite helpful with instructions during lab hours.",
                "The TA was available to respond to questions during the lab and always gave very helpful responses.",
                "Helped when I was stuck on the labs",
                "Lily was very helpful in the lab, helpings work through thorny problems",
                "often helped us understand and fix issues with our labs",
                "Their office hours and help in lab time",
                "Labs",
                "Lab was run by multiple TA's, most of which were wonderful. I learned most from discussing questions with them and problem–solving together."
            ],
            "What could the TA modify to help you learn more?": [
                "n/a",
                "The TA did great during labs – not much to improve on.",
                "Earlier lab sections felt a bit disadvantaged because the TAs probably weren’t aware of issues present in the instructions.",
                "Nothing",
                "I wish the TA had given a brief overview of the lab and the concepts therein at the beginning of each lab section.",
                "N/A",
                "Lily's the best, noting",
                "Nothing",
                "Nothing, really. You all are doing great!!"
            ],
            "Additional feedback to the TA/CA/Intern:": [
                "n/a",
                "Lily you're the best",
                "The TAs were absolutely amazing",
                "Thank you all for the time and effort you put into helping us during labs and office hours. I do wish Drhuv Baid was a bit more understanding and willing to help students who were struggling; I asked him for help several times when I was really having a hard time, but only really got useful information from him when I was close to getting something right."
            ],
            "Other course elements not mentioned above:": [
                "Project"
            ],
            "Please comment on the level of difficulty of the course relative to your background and experience.": [
                "Very easy if you have any previous experience in CS.",
                "Challenging but very reasonable",
                "Have very little CS experience but the class still felt very doable.",
                "Pretty manageable given fairly strong CS background",
                "It was quite challenging.",
                "Not super difficult as a math major, but still time consuming",
                "I found this class quite difficult. I had no prior experience and it felt like I should have learned about computer science on my own before I started this course, which is what I learned to do in order to keep up.",
                "If you're more of a beginner in computer science, this course will be really challenging, but not impossible",
                "I have a fair bit of experience with CS (Python, C#, some JS) and the course was very easy for me",
                "As somebody with minimal experience, the class was doable until the projects, which were seriously difficult and time–consuming",
                "Very difficult, however, I believe the course is fair.",
                "fairly tough but quite rewarding",
                "had a little background experience, and as a result this course was not too difficult",
                "Not too bad but the final was hard",
                "I had experience with other code but unless you have experience with Racket or other lisp programs it won't really service you.",
                "Having previous background in CS, it was really not that hard, but still was interesting and took some time",
                "Quire difficult but in a good way",
                "This course was incredibly difficult for me. I have a little prior coding experience, but I spent 15–20 hours per lab, 20–30 per homework, and even more for projects. This class was very fulfilling, but definitely very difficult. I would not recommend to students who just have a casual interest in comp sci. I definitely slacked off in other classes to devote as much time and attention as possible to this one."
            ]
        }
    },
    "5": {
        "course-section": "CMSC 15100 3",
        "instructors": "Timothy Ng",
        "quarter": "(2218) Autumn 2021",
        "comments": {
            "What are the most important things that you learned in this course? Please reflect on the knowledge and skills you gained.": [
                "I learned how to think about programming in terms of individual functions and how, when working together, they can form a program.",
                "Coding in Racket",
                "Importance of modularity + testing (good coding practices)",
                "how to think of problems",
                "interesting ideas on how computers work",
                "Racket and recursion. Basics and coding and algorithms",
                "How to think recursively",
                "The basics of CS logic.",
                "Basic Racket Algorithms. Recursions. Red Black Trees.",
                "Induction, pattern matching, binary trees.",
                "working with data structures, organizing code, thinking through problems",
                "functional programming and problem solving techniques, typed–racket",
                "Racket, functional programming, trees and other structures, recursion, some higher level programming",
                "A very good understanding of the structures and rationale behind good programming practices",
                "The most important things I learned in this course were how to navigate functional programming languages, how to program with various data structures, and how to effectively utilize structural and generative recursion. I also learned how to approach larger projects from a modular perspective to streamline my workflow.",
                "Learned Racket.",
                "Racket, recursion, sorting, data structures, higher order programming, etc.",
                "The basics of computer science",
                "computer science principles, recursion, functional programming",
                "I learned how to think logically and critically",
                "Racket, data structures and algorithms",
                "I feel like I will likely not use the actual programming language Racket in the future, but I think the concepts I was able to learn from the language helped me understand the basics of computer science in a way that is not just about syntax.",
                "I learned how to code on the Racket language and how computer science is just mathematics but in a fancy way.",
                "adopting another thinking method, recursion, logical thinking",
                "Using Racket."
            ],
            "Describe how aspects of this course (lectures, discussions, labs, assignments, etc.) contributed to your learning.": [
                "Lectures were very straightforward and moved at a reasonable pace. Assignments, labs, and projects helped clarify and provided practice for material covered in lecture.",
                "lectures were very helpful,",
                "office hours were very helpful,",
                "labs were sometimes not adequately explained/a bit confusing, but overall good",
                "homeworks were overall helpful.",
                "The quick responses on Ed and the good answers we got were irreplaceable as a way to learn/get unstuck on some of the problems we faced.",
                "I liked that labs and homework assignments helped reinforce the concepts we learned in class, but especially toward the middle/end of the quarter when more difficult material was being introduced, those assignments became much more time consuming.",
                "Labs were probably the most important for my learning",
                "Thought the lectures and assignments were all very helpful",
                "the professor's online notes were very helpful",
                "Lectures were great and labs added on to the lecture content",
                "The lectures are pretty clear and helpful.",
                "Labs were very useful, same with homework. I mostly skimmed lecture notes",
                "Labs and homework were far more useful than lectures in understanding the content. Final project was cool. A couple labs felt way more difficult than the rest.",
                "lectures were helpful but not always directly related to homework/labs, homework assignments were really where you would find out if you were learning or not",
                "lectures were very educational, but most of the learning came from actually doing the labs and homework assignments",
                "I feel like most aspects of the course were helpful in my understanding of the material.",
                "Lectures were very important to my learning, since they were where all the content was being taught. Labs and assignments were more of a reinforcement of the concepts taught in lecture, but were nevertheless very helpful.",
                "The labs were extremely helpful in my learning.",
                "Lectures were always recorded, so you could go back and rewatch portions you didn't quite get the first time around.",
                "A majority of learning was done through labs and assignments, and some through lectures",
                "lectures were very helpful and structured in a productive way. labs were actually so useful; I thought I'd dislike them, but the TAs were incredible and the lab design was excellent.",
                "They confused me. I don't think the class is for beginners. It is more for kids who have already delved into code and therefore can understand the notes and hws.",
                "Labs, homework, and projects align closely with what we learn in class.",
                "The lectures were early in the morning, so some were hard to understand, but they were posted online which was really nice since it allowed me to look back at what was covered on certain days. The labs and assignments were also nice and helped me apply what I learned in sometimes real–life situations.",
                "Labs are absolutely the most helpful things. No cap. Homework also provides us enough practice.",
                "in lectures, we go over new materials and learn about new function structures/contents",
                "in labs, we apply our knowledge into assignments under TA's supervision",
                "in assignments, we are tasked to write functions that often involve newly learned contents",
                "Lectures provided lots of information that was very much necessary in order to continue in the course."
            ],
            "Additional comments about the course:": [
                "instructor was really good.",
                "This class is very hard, and very time consuming outside of class.",
                "Tim is truly an amazing guy",
                "Racket is a weird language but it kinda grows on you",
                "Sometimes what was required for project work was unclear, and I had to guess what was necessary by watching a video demonstration.",
                "My favorite class this quarter! I really enjoyed both the material and the assignments. Ng is a great teacher too!",
                "A big time commitment",
                "a good idea to take for any field. even if you never end up using computer science, it teaches you a new way of thinking about problems.",
                "If you are a beginner, I recommend waiting or taking math classes before.",
                "Not a lot."
            ],
            "Thinking about your time in the class, what aspect of the instructor's teaching contributed most to your learning?": [
                "Professor Ng was really good at clarifying confusion in class when questions were asked.",
                "their ability to answer questions concisely, in a way easy to understand. After every concept, they would pause for a bit to let the class ask questions, and, unlike some other classes, students felt comfortable enough to ask them :)",
                "The written notes posted after class were often more helpful than lecture because they laid out the concepts we covered more clearly.",
                "Walking through the steps of algorithms on the chalkboard",
                "Ngs lectures were great",
                "How he went over concepts instead of writing code",
                "There are two office hours on the day we have classes. These are pretty helpful for labs and assignments.",
                "Nothing",
                "Giving examples and walking step–by–step through data structures",
                "his lectures and code–alongs were good",
                "Showing examples of the functions in Racket while teaching",
                "Labs with the LAB Tas were very helpful as was the ed discussions.",
                "The online notes that they posted following the lecture to provide a review for concepts covered during the lecture. Professor Ng was also very eager to ask for questions continuously throughout his lecture.",
                "Professor Ng was really helpful during office hours and explained topics very well during class!",
                "responsiveness on Ed, office hours were well organized, and lectures were easy to follow.",
                "His notes",
                "Ng's lecture notes are crucial to review and understand his lectures. He is very clear in explaining all the concepts",
                "The instructor did an especially good job at making concepts clear – I feel that sometimes I would not understand something at first, and without asking, he would clarify it later which helped my learning.",
                "I don't know if the lecture contributes to a lot of my learning. I mean, I learned the basic bullet points of the language and the algorithm, while the homework/labs are pretty much open–ended in terms of discovery",
                "Professor Ng's notes were really helpful because they summed up the course content in a concise way",
                "The lectures"
            ],
            "What could the instructor modify to help you learn more?": [
                "perhaps if the screen was in the center of the classroom rather than on the right hand side. My vision is bad, so i had to move over when i was sitting on the left hand side to get a better view of the code",
                "During lecture, it often felt like I was just blindly copying down the code that the professor was typing up and barely keeping up with the ideas being introduced, so spending a bit more time on the concepts/reasoning behind the algorithms or data structures would be helpful.",
                "Slowing down a little. I think a lot of it is due to the 9 week quarter, so professors had to condense. But it happens too quickly.",
                "n/a",
                "Make class more engaging",
                "Make the instructions of the project clearer.",
                "Nothing, resources were all very accessible.",
                "Not sure – I appreciated the notes after each lecture. Maybe make the classes more connected with labs and HW?",
                "a little more interactivity during lectures or more connections between lectures and our assignments for that week",
                "More feedback on our work",
                "Maybe more comprehensive lecture notes.",
                "I thought Professor Ng was a brilliant teacher and honestly can think of no suggestions for improvement.",
                "Sometimes the lectures seemed to lack structure as in you weren't really sure what topics you were learning. At times, my notes end up being a collage of functions we write in class, random Racket facts, and definitions, and I wouldn't know what the overarching theme of the material was.",
                "n/a",
                "I'm not sure if the intention is to weed out, but they do discourage kids from even finishing the course. A lot of kids withdrew or dropped out. The class is discouraging for beginners interested in CS as a minor or major or any track.",
                "Nothing significant. Just slow down at the end of classes rather than rush through a new function definition",
                "no",
                "I don't think there's a modification needed. This is the open–source nature of computer science because you learn the most basic things and then compile them up together to achieve what you want to achieve.",
                "I found that toward the end of the course some of the topics were just shown to us and didn't appear again until the final. It would definitely be helpful to have some sort of homework to get acclimated to those."
            ],
            "What aspects of the TA's teaching contributed most to your learning?": [
                "Angela was very quick to run over in lab when someone had an issue and clarify what was going wrong. She was good at giving hints without giving answers.",
                "Helping in labs and office hours",
                "Helping to debug during labs",
                "He was so patient!",
                "Nick was great! Super helpful in labs, very nice/friendly and great at explaining content",
                "help during labs, office hours",
                "During lab instruction",
                "Helping me realize where I was going wrong during my labs",
                "Help during the lab.",
                "All of it, mainly answering questions during lab sections",
                "ability to explain CS problems in a simple way. helpfulness during labs",
                "Oh my god, Nick is absolutely the god of CS. I am going to miss him so much. He is pretty much the reason I did not fail my classes.",
                "Being very clear and helpful with not just homework but also course materials",
                "He was extremely helpful during lab sessions, and was able to provide help without giving everything away all at once."
            ],
            "What could the TA modify to help you learn more?": [
                "Smaller lab sections would allow TA's to help more. There are long wait times within labs to get help because there is only one TA for many students",
                "n/a",
                "Nothing",
                "N/A",
                "n/a",
                "n/a",
                "He is perfect. I think the only thing that he needs to improve is to provide a slightly more flexible office hour schedule, and office hours HAVE to be in person. Zoom just can't achieve the effect.",
                "–"
            ],
            "Additional feedback to the TA/CA/Intern:": [
                "Nick was great and easy to understand. Thank you!",
                "I love Nick he is the man",
                "Nick was absolutely wonderful and as of right now is the best TA I have ever had, he helped me anytime I had any problems and I cannot say enough good things about him",
                "thank you!!",
                "Nick I love you"
            ],
            "Other course elements not mentioned above:": [
                "The labs were basically self–taught lectures."
            ],
            "Please comment on the level of difficulty of the course relative to your background and experience.": [
                "As someone with almost no prior programming or computer science experience, this course was perfect in that it was challenging but also totally possible to manage.",
                "i thought this course did a good job teaching me CS. I had a little bit of background in coding in high school, but remembered very little. I think it was manageable for people without coding experience, but am not sure",
                "I came into the class with zero CS experience, and I found the class to be quite difficult and incredibly time consuming (especially the project), even though I learned a lot.",
                "I have no prior coding experience, and the class was extremely difficult. It took me 40 hours outside of class some weeks to finish assignments, and sometimes the 2 days for labs and 4 days for homeworks were not enough, and I turned it in incomplete. Racket is a very difficult langauge to learn for a first time coder, instead of Python or Java, which would also be more useful for internships and the future,",
                "This is going to take a LOT of time out of your day",
                "This course would be easier if you have previous coding experience",
                "I would not recommend for people with a strong math background. While I thought Prof. Ng was knowledgeable and engaging, the course is clearly geared toward people with no cs experience, and who are interested in developing a more practical grasp of cs. I had hope when Prof. Ng alluded to Peano arithmetic in one of the early lectures, but for the most part, I did not find this course conceptually challenging. If you are a math person, take honors; otherwise, this is a class in becoming proficient in Racket, take this course. That being said, I could totally understand why someone who is doing cs for the first time and just wants to learn to code would want to take this class, and would recommend it.",
                "Racket is difficult starting out, but after the first couple weeks it's similar level to HS CS classes",
                "if you have no CS/coding experience I'd imagine this would be pretty difficult to follow along, it's a language people don't typically have experience in but some coding background would help you follow along",
                "For having very little background in cs, it was challenging but far from impossible",
                "Even with four years of high school programming experience, this course was challenging at times. However, if you go to office hours and put in the work, I think you can still do wel in the class.",
                "I had some experience with CS in high school, but I found that it didn't really apply much to this class. I found the class to be quite challenging but in the best way possible––it convinced me to pick up the CS major! I was able to understand everything with enough review.",
                "This course was challenging but it is doable if you really enjoy it, not for those who don't want to commit plenty of time to it",
                "As a beginner and friend of beginners, this course was extremely difficult and discouraging. If you have a strong math or cs background it is fine. But beginners fall behind and are normally below the average.",
                "I have never worked with a functional language before, but the class was doable, and I learned a lot despite a more limited background.",
                "it is quite difficult for a CS rookie, I have to say, but it gets better...",
                "Prior to this class, I had no coding/cs experience. I would say the learning curve was steep in the beginning, but other than that, I didn't have much trouble catching up after the third/fourth week."
            ]
        }
    },
    "6": {
        "course-section": "CMSC 27100 2",
        "instructors": "Timothy Ng",
        "quarter": "(2238) Autumn 2023",
        "comments": {
            "What are the most important things that you learned in this course? Please reflect on the knowledge and skills you gained.": [
                "How proofs work, how to work with discrete structures",
                "learned about discrete mathematical structures, learned how to prove things by various methods like induction and contradiction. learned a lot about mathematical logic too.",
                "Basic number theory, basic proof techniques, combinatorics, probability, graphs",
                "In this class, I learned a number of concepts about discrete mathematics, including graph, probability, and set theory, divisibility and congruence.",
                "How to write proofs; how basic elements of math and cs can be proved.",
                "Introduction to proving basic logic problems, probability theory, graph theory, divisibility",
                "A variety of discrete math topics: number theory, modular arithmetic, graph theory, probability, combinatorics. I also learned proof writing skills and mathematical reasoning, such as induction, proof by contradiction, etc.",
                "Mathematical Proof",
                "Proof writing skills vastly improved. Gained exposure to many areas of discrete math",
                "The fundamentals of discrete mathematics, how to write mathematical proofs, and expanding my overall thinking of discrete math structures. Definitely expanded my ways of thinking with math and the possibilities it has.",
                "How to write proofs and some basic discrete math concepts (prob theory, combinatorics, graph theory etc. all in very limited capacity)",
                "Many topics covered, covering the basics of first order logic, proof technique in induction and contradiction, number theory, modular congruencies as equivalence classes, combinatorics, graph theory, and probability theory.",
                "",
                "All of these topics are developed from a proof–based perspective, so your ability to make rigorous mathematical arguments is honed a lot here.",
                "I learned how to properly write mathematical proofs, mainly through induction and developed a better understanding of graph theory and combinatorics.",
                "Graphs, modular arithmetic, induction, proof techniques, probability, gcd's.",
                "I learned about the process of proof writing and certain mathematical underpinnings for common computer science related topics.",
                "How to do proofs, logic, graphs, combinatorics, probability, some other topics",
                "Math and logic",
                "Proof–writing, probability theory, some algorithm analysis, combinatorics",
                "Proofs by induction, general approaches to certain kinds of proofs, and some more detailed understanding of certain discrete structures and their applications.",
                "mod, induction, graph theory, combinatorics, probability",
                "This was a proof–based mathematics course that went over formal mathematical logic. It taught the different ways to prove a mathematical statement, within the scope of combinatorics, probability, modular arithmetic, and basic operations.",
                "how to write proofs, combinatorix graphs modular arithmetic"
            ],
            "Describe how aspects of this course (lectures, discussions, labs, assignments, etc.) contributed to your learning.": [
                "Most helpful were lectures",
                "lectures and problem sets are the main structure of this class. discussion/quizzes was pointless and unhelpful for me.",
                "Lectures are super helpful, and Professor Ng makes amazing lecture notes that he posts online. If you can’t go to lecture, 100% read the notes and you’ll be find. Discussion sections were fine, quiz at the start then we practiced some proofs.",
                "The class was mainly conducted through lectures, which were relatively easy to follow and went in detail over the course material. In addition, the TA sessions offered an opportunity to further apply the concepts we had learned in class.",
                "Lectures were helpful for introducing myself to the topics, but were so fast I often didn’t understand the content until I was able to look at it on my own. Prof Ng’s notes are awesome",
                "Tim exceeded my expectations in all aspects of this course! He was very clear and concise in lectures and having the quizzes during discussion sections incentivised me to go and also made sure I knew the basic concepts that were covered. I think the best part of this course was definitely Tim's focus on learning and improvement, as is evident by his generous homework resubmission policy and flexible course grading system that gives you the chance to improve from your midterm and puts more weight on your final if you improve",
                "Lectures introduced the topics, problem sets forced me to learn how to do the math introduced in class, quizzes checked for understanding",
                "Lecture Notes are superb",
                "Lectures were great, problem sets useful. Did not enjoy the weekly quizzes, however. I assume this is meant to force people to attend the discussion sections, but many would leave just after the quiz. I would much prefer just having a tutorial.",
                "Lecture and lecture notes helped a lot. Though, I will say the quizzes helped but was still difficult regardless.",
                "Lectures were great and Timothy Ng is one of the best lecturers/profs I've ever had",
                "Lectures were pretty helpful, any proof–based course needs to have theory developed and written on the board and this course followed suit like any other math class here would.",
                "",
                "Homework assignments consisted of 3 problems weekly, and they were always of the perfect difficulty. Not too easy such that they were trivial, but hard enough to make you think a little bit and put some time towards it. The homework was where the learning really happened, and I enjoyed all the PSETs this class gave.",
                "",
                "This class had required discussion sections, and in my opinion, they were truly worthless. The discussions always started by giving a 15–minute computational quiz, which you either ace if you've already seen the same style of computations before in another class or you do super poorly if you haven't. There's rarely time to closely study the content the quiz is examining you on in between the time it's covered in class to the time it's examined. This was more of a function of the TA, but the tutorials that followed the quizzes contributed absolutely nothing. to my learning The TA would make us do the work on our own, which I could just do at home, and then try to guide us through it himself, which was typically met with dead–air from the student audience.",
                "The only saving grace was that you could leave discussion after quizzes, you didn't have to stay, and so I found it much more beneficial to go through the discussion exercises on my own, then ask about it on ED or office hours if I was confused.",
                "The lecture was very helpful, the quizzes were helpful with keeping track of everything, the notes online were very helpful.",
                "Lectures introduced all of the content and thoroughly described how and why it would be useful as well as how it could be understood best. Discussions developed on the foundations in lecture with more challenging extensions of the most recent topics.",
                "lectures and lecture notes were very helpful for deeper understanding",
                "Lectures and lecture notes were very useful",
                "Lectures were good, discussions helped I liked the format of quizzes and such.",
                "Lectures introduced new concepts, which seemed to come in units of 3–4 at a time. 1 Pset per week, 3 problems. Discussion once per week with a quiz at the beginning of each discussion.",
                "Lectures were helpful for learning the material. Lecture notes were posted online, which was very helpful in being able to review parts that were confusing the first time. Discussion sections and problem sets helped us engage with the material in a more critical way.",
                "The online notes, homeworks, and exersises from the textbook contributed most to my learning.",
                "The lectures were really fast–paced, but the accompanying notes helped to compensate for that. The assignments usually covered difficult case scenarios for the content we learned in lectures. Discussion sections assessed a higher level of understanding of previous course content, but I felt I did not benefit from these due to the structure.",
                "lecutres are great, timmy is a very good communicator, concise effective. Lots of office hours which were super useful because he will immediatley understand where you are failing to get the material and walk you through it. TA office hours also helpful, lots of oppurtunities to undertsand material outside of class time. Discussion also good, going through practice problesm with tas. Problem sets #1 contributoer to learning, i think could be longer just so we had more problems to practice. TIMMYS NOTES ARE THE MOST USEFUL."
            ],
            "Additional comments about the course:": [
                "If you haven’t had a proof–based math class before, brace yourself. The learning curve is steep, but Prof. Ng is a fair grader and there’s a lot built into the class to help you get a good grade even though you might feel like you’re failing.",
                "This course was extremely difficult, coming from someone who had no experience in proofs before.",
                "Timothy Ng is the GOAT",
                "The course text is \"Discrete Mathematics and Its Applications\" by Kenneth H. Rosen and I found this book IMMENSELY helpful whenever I was lost. This class can go a bit fast at times with the more advanced content (like CRT, equivalence relations, and binomial distribution), and the textbook is where all of it is slowly broken down for you step–by–step to take in at your own pace.",
                "",
                "Full of examples and complete proofs, the book is highly highly recommended to study from.",
                "Excellent introduction to proof based math",
                "Up until the final the class was very easy, the final was hard though. Timothy is a great professor, explains the material brilliantly and is able to answer all questions well.",
                "I studied for the exams for a very long time and some questions just felt unreasonable/required lucky thinking that wasn't covered in the course",
                "This does not have to do with this specific section or instructor, but I was a bit disappointed with the material of this course. Topics covered seem to be pretty disconnected without a consistent through–line, and coverage is shallow. Entire 'units' of 2–4 lectures (e.g. proof writing, probability) amount to the equivalent of 1–2 lectures from a more focused course (e.g. MATH 15910, STAT 25100).",
                "",
                "I'm not sure why it is a requirement for CAAM, which already requires MATH 15910/160s, and STAT 244–245–251.",
                "The class allows for collaboration, so form a study group if you can. Otherwise, you are at the mercy of your TAs. :/",
                "best discrete class i could have had, 10/10"
            ],
            "Thinking about your time in the class, what aspect of the instructor's teaching contributed most to your learning?": [
                "Lectures and lecture notes",
                "Lecture and lecture notes",
                "the professors notes are amazing, pretty good at lecture as well.",
                "Lectures and proof examples, as well as the lecture notes. Please don’t stop making the lecture notes!",
                "The professor made great effort in making the content of the class as understandable as possible, providing examples and going through the proofs slowly enough, allowing time to comprehend them.",
                "His lectures and notes were great.",
                "1) Tim's availability outside of class and willingness to help students learn. Tim had office hours on 4 days every week, which made it very easy to find time to talk to him outside of class. Tim was also very active on Ed so I felt supported and cared for. Additionally Tim seemed to have endless patience for answering even stupid questions",
                "2) Tim's lecture notes – amazingly structured and very easy to understand! Everything we were tested on was covered in the lecture notes and Tim was very good with keeping the lecture notes updated",
                "3) Tim's focus on learning and improvement. Tim had a very generous homework resubmission policy which was amazing because it allowed our initial submissions to be graded somewhat more harshly which pushed me to learn more when I resubmit it. The overall course grading scheme was also very ideal because it gave us a chance to improve from our quizzes and midterm. This was also good for stress management and overall I think more courses should be structured like this",
                "I appreciate how intentional Professor Ng's pedagogical choices are–––I think choices like allowing resubmissions on problem sets and making class notes available online are effective in motivating us to learn. Professor Ng is also very approachable and receptive to questions during office hours. I can tell that he cares a lot about teaching.",
                "Lecture Notes",
                "Tim is a great lecturer",
                "the lectures and office hours helped a lot",
                "Lectures and posting detailed lecture notes + great/interesting problems on the problem sets",
                "Tim Ng is a really great lecturer and a super organized professor. His board work is neat, he's well–spoken and he often motivates the content we learn with plenty of analogies, references to 14100/15100, and comparisons to real–life examples.",
                "",
                "On top of that, Tim maintains a course website for everything he teaches, where a compendium of ALL lecture notes can be found for everything covered in lecture on a particular day. This is really the best part about Tim Ng's work as a professor, he's so meticulous and organized with these notes that it's an amazing point of reference and place to study from.",
                "",
                "If you really wanted to, you could pass this class by never attending lecture, never reading the book, and JUST reading his lecture notes, they are THAT good. Invaluable resource.",
                "",
                "Tim also embeds a lot of his research interests into the work you do in this class, which is really neat to see. He's studied strings and words a lot in his research, so many exam questions and homeworks have to do with strings blended with the concepts you learn in this class.",
                "Profesor Ng's lecture notes were incredibly helpful and the best I have encountered.",
                "His lectures and responses on ed.",
                "The clear and effective communication combined with the thought out presentation was invaluable in helping me understand the rather complicated topics.",
                "Very clear lecture notes",
                "Lecture, Ed Discussion posts/replies",
                "The professor is very good at explaining these topics in a way that guides you to the answer instead of giving it to you directly. His notes were also very clear and he had frequent office hours, making studying much easier.",
                "The lecture notes posted on the course website were informative and helpful. Office hours with the professor contributed the most to my conceptual understanding of the course content.",
                "office hours, dude has a BIG brain, his lecture notes are really well explained"
            ],
            "What could the instructor modify to help you learn more?": [
                "Nothing, the class was great",
                "Not much",
                "eliminate/replace the quizzes/discussion.",
                "Studying for quizzes was difficult, and they tended to be all or nothing. I’d prefer more proof–based quizzes since that’s what we study for the homework.",
                "I don't think he could do much to improve, I was very satisfied with his teaching.",
                "Not sure; he moved really fast but I don’t see how he could teach the same amount of content and allow for more clarification during lecture.",
                "Nothing, this course was excellent and Tim is the GOAT",
                "This is a bit trivial but Prof. Ng could write a little more neatly on the board. I would sometimes get lost in the sauce taking notes, and then look up and be unable to read what he had written.",
                "NA",
                "I felt the quizzes were good but rather difficult and at points would put an unnecessary weight on the students' minds with regards to their final grade.",
                "I think it was one of the best taught courses I've had at this University",
                "As a lecturer, Tim suffers from an issue that's too common to see in math classes. During lecture, Tim will often ask the class many \"ill–posed questions\" (this is how Robert Fefferman of the math department words it) with the expectation that at least one student will be able to answer him. He'll awkwardly pause the class in silence until *someone* is able to give a satisfactory answer, dismissing students who answer incorrectly with a very curt \"nope\". It feels as though we're expected to read his mind on what he wants us to say at times.",
                "",
                "Personally, I would rather he continue lecturing without stopping to ask these questions, because he's an excellent speaker and I'd rather hear how *he* imagines a concept, not how my peers think of it. (that can be saved for discussion on ED)",
                "",
                "Also, Tim gets nerd–sniped really easily in class when a student asks a challenging question, which can halt the class at times.",
                "More practice for the final but overall nothing.",
                "I honestly can't think of anything aside from my preference to have course materials on Canvas rather than a separate website.",
                "Give more practice questions w/solutions to prepare for midterms and finals. This was my first proofs class and I felt unprepared for the proofs on exams, even after memorizing all of the material.",
                "Providing a roadmap for the course material at the beginning of the quarter",
                "The spacing of the assignments/topics could have been improved. Since the course is fast–paced, I would constantly need to review the current week's content to prepare for the quiz and master the previous week's content at for the problem sets. Since the problem sets required more time and attention, I would prioritize the problem sets and perform miserably on the quizzes at the time I took them. Additionally, I wish that students were allowed the opportunity to go to other discussion sections since I did not benefit from the one I was assigned to. Most of the students in my discussion section would leave immediately after taking the quiz because they did not find it beneficial.",
                "more problems"
            ],
            "Please include the name of the TA/CA/Intern you are evaluating. What aspects of the TA's teaching contributed most to your learning? What could the TA modify to help you learn more? Please include any additional feedback for the TA/CA/Intern.": [
                "Jacob, Yilin, Eric, Tiago; they all had really helpful office hours and made homework problems seem much easier to deal with",
                "Eric Liu",
                "Jacob was a great TA — really helped me understand the psets every week while still challenging me to try it on my own.",
                "Tiago and Eric. They were both receptive to questions and were helpful when I got stuck on a problem.",
                "My TA Eric helped a lot with really understanding homework questions and concepts that we learned in class. Plus, he was very thorough and patient with all of us whenever we had questions or ran into trouble with understanding anything. Eric was a goat.",
                "Tiago Royer. I'm sorry, but he needs to work a lot on his presentation skills as an instructor. He needs to project his voice more with his diaphragm and be more enthusiastic about the material. IMO, a good instructor convinces me of the importance of what we're learning, and I just didn't get that from Tiago.",
                "",
                "It is clear he is knowledgeable and smart, and while this is a necessary condition to be a good teacher, it is not sufficient.",
                "Tiago Royer",
                "Eric Liu. His lack of pedantry and effective communication were very helpful with clarifying ideas from class. I'm not sure what else he could have done to help me more.",
                "Eric",
                "Eric Lieu was my discussion TA. His explanations of discussion tutorial problems were helpful.",
                "Tiago Royer facilitated discussion sections and held weekly office hours. He is very good at explaining the material and is very patient, making him a great instructor.",
                "Tiago Royer – Tiago's discussion sections did not contribute to my learning. We would spend most of our time going over half of the questions in our sections, which would leave us with incomplete answer tutorial sheets unless we asked for help during office hours. His explanations of the content were unclear, his work was illegible and difficult to follow, and the students who remained in the section were unengaged. During office hours, he would not thoroughly explain if my understanding of the problems was correct and would usually leave me with more questions than answers. There have been a couple of occasions where other students would interrupt a question I was receiving help with, and he would entertain it. No time is provided for me to digest the content explained and ask follow–up questions, while other students had this opportunity.",
                "Tiago. Very smart and knows what he is doing, super nice and supportive. However, his handwriting is difficult to read which sometimes made it hard to follow his work. Definitley knew what we were doing super well and was very precise with his proofs."
            ],
            "Please comment on the level of difficulty of the course relative to your background and experience.": [
                "I took intro to proofs so the class was easy, but I would say the class was a better introduction to proofs than introduction to proofs. Professor Ng is great",
                "easiest math class I've taken here, not that it is exactly easy. but much better than the math 180s.",
                "STEEP learning curve with no proof experience beyond the slight induction stuff in the 150s, but very doable and lots of resources to help you learn. Would definitely recommend Professor Ng!",
                "I felt that the course was not that challenging, as the lectures were relatively easy to understand. The most challenging part, I'd say, was to make sure to add as much detail as possible when answering problem sets, as the grading was rather strict, cutting off points because I had not mentioned, yet I assumed they could be taken for granted.",
                "It’s hard at the beginning, esp if you haven’t done proof based math before. But it’s also super interesting and kind of fun. Go to office hours and you’ll be fine.",
                "As an Econ and CS major with not too much proof based math experience, I thought it was of moderate difficulty. The concepts are relatively simple and some of it is pretty interesting too. I did find the grading on the problem sets a bit pedantic, but thats probably intended, and luckily we were able to have resubmissions.",
                "This course is extremely difficult, definitely be prepared to spend time at office hours and really try to understand all the different ways of thinking that comes with this course.",
                "With any math background it is fairly easy, but without it, the first few weeks can be a little rough",
                "I'm a math/CS double major so this course wasn't all that bad for me. If you've taken the MATH 160's, this course covers the early topics of 161 at a much slower pace, which makes the first half of the class a breeze. Consider taking Honors Discrete instead if you want to be challenged (I took the regular version because Tim Ng is awesome)",
                "",
                "If you're not a math major or have just never had experience with proof–writing before, this class is a good introduction to proof–based mathematics. I think you'd need to read the textbook pretty heavily at–first to get a grip on how proofs go, but it's certainly possible to do well in this course as a CS–only major.",
                "",
                "The hardest parts of this course were definitely the exams. Midterm was reasonable, but the final exploded in difficulty by introducing new structures mid–exam that blended together our built–up knowledge into new concepts. I'm really not a fan of this exam style, but it's what you get here, so beware.",
                "CAAM major, not hard at all but the final was difficult",
                "I did not have any meaningful background, and the class was the most challenging one that I have taken so far.",
                "very difficult",
                "It was very difficult for me, I had no proofs experience before this class",
                "Prior to taking this course I took MATH 15910, 20250, 203–204–205, STAT 244–245–251, CMSC 141–142–143. This course was not trivial by any means, but I did not find it very difficult or time consuming.",
                "Fairly difficult course that requires effort, but little pre–requisite knowledge needed. Knowledge of programming in at least one language does help though because it gives context to what you are proving.",
                "As a student who wrote proofs in the MATH 150s sequence, this course was extremely challenging, I felt I did not have the time I needed to be successful in this course.",
                "had little expereince and did take work, but class is made to be v accesible"
            ]
        }
    },
    "7": {
        "course-section": "CMSC 27100 3",
        "instructors": "Timothy Ng",
        "quarter": "(2198) Autumn 2019",
        "comments": {
            "What are the most important things that you learned in this course? Please reflect on the knowledge and skills you gained.": [
                "Graph theory; the differences between and when to use permutations and combinations (combinatorics); introductory logic",
                "Graph theory, probability theory",
                "We learned about number theory, set theory, combinatorics, probability, and graph theory",
                "How to prove things mathematically. Specifically, what kids of things you have to show and which ones you can assume.",
                "An understanding of what Discrete Math is, and the most interesting aspects were about Probability theory and Graph theory.",
                "Developed a better comprehension of working with proofs and using number theory.",
                "I learned basic concepts in discrete math.",
                "Various topics in discreet math, including number theory, combinatorics, and graph theory",
                "I learned a lot about number theory and set theory.",
                "I learned about discrete math concepts like proofs, division, probability, and graphs.",
                "Learning about number theory and graph theory was cool because I had basically no background in those subjects.",
                "counting and graphs",
                "number theory, mod arithmetic, set theory, propositional logic, probability, expected value, combinatorics, graphs",
                "discrete math"
            ],
            "Describe how aspects of this course (lectures, discussions, labs, assignments, etc.) contributed to your learning.": [
                "The lectures were really good; Professor Ng is a very good lecturer; very clear and concise lectures, structured very well; he also uses the board very well, and stays on track and organized; he also uploads his lecturer notes to Canvas to review later, but I would recommend attending all classes because he explains things very well",
                "Lectures were great, Timothy went through concepts carefully and answered questions",
                "lecture was very important to understanding the material",
                "I really appreciated how Tim put extremely detailed notes of exactly was was covered in class online. That way if there was something that I didn't understand, I could go back later and look at it again. Also this was really helpful for studying for exams.",
                "The lectures were pretty good, and the lecture notes were very good. Prof. Ng was also super open to people dropping into his office, and was very helpful. Discussion sections are useless.",
                "The online notes were really helpful for completing both the homework assignments and studying for exams.",
                "Lectures were great! Tim was an excellent lecturer.",
                "Lectures weren't really helpful because it was just the notes being read out loud, but to be fair, those notes were insanely good. Like I hate math and I'm terrible at it too but the notes were exceptionally clear, fun to read, and overall indescribably helpful.",
                "PSets were reasonable and the lectures contained a lot of information and were easily available",
                "Lectures notes were amazing. I feel so grateful that Professor Ng put those up on his website. Assignments were a good length and were not difficult if you attended the lectures/read the notes.",
                "notes online nice website",
                "lectures were very clear and thorough, and Tim had online notes which were extremely extremely helpful (pretty much written class notes and were very engaging!) when you weren't able to make a certain class.",
                "lectures were amazing"
            ],
            "Additional comments about the course:": [
                "Very good prof; learned some interesting things; especially the intro to logic and intro to proofs",
                "Keeping up with material is the most important part, if you get behind on the material it can become a big problem",
                "It isn't particularly hard but you do need to know your definitions of things.",
                "Tim was really great at teaching these topics!"
            ],
            "Thinking about your time in the class, what aspect of the instructor's teaching contributed most to your learning?": [
                "His crystal clear board organization; also, his use of examples is great",
                "His lectures were very good and he explained everything fairly well",
                "He did a good job explaining things. Also as mentioned earlier, the online notes were great!",
                "Professor Ng gives very clear examples, great lecture notes, and is amazing in office hours. Very down to earth guy, and pretty relatable for a CS/math professor.",
                "Tim was a great instructor who was very organized and made sure that students felt that they could succeed in the class. I came in hesitant as I did not have a good background in proof–based math, but I felt that all of the concepts were explained at an attainable level and served as a good introduction to proofs.",
                "He posted the lecture notes online.",
                "Timothy explained concepts very clearly and was a strong communicator. His online notes were also extremely helpful for clarifying concepts from class.",
                "Tim is not really an interesting lecturer since he just reads his notes and kinda plows on proof after proof, but his notes are ridiculously good and he does his best to try to be helpful and available outside of class. He was super reasonable with his time demands and Psets, very organized, and in general a pretty nice/chill dude so I was pretty happy with the class despite not going to lectures often (sorry Tim)",
                "His office hours were very helpful. I was able to go to him often and get help on psets or topics I struggled with in class.",
                "Overall Professor Ng is a great teacher. I feel bad for not participating more when he asked easy questions to the class. He was also active in answering questions on Piazza.",
                "Was very receptive to questions and always willing to explain. Very understanding instructor. Would recommend.",
                "His notes and interesting anecdotes for the problems were awesome. He also had office hours which were very helpful if you were struggling. Very open to questions as well.",
                "amazing lecturer, very fair, patient, organized notes"
            ],
            "What could the instructor modify to help you learn more?": [
                "Nothing!",
                "He went very fast, so if you didn't understand one thing it could effect the whole lecture.",
                "Maybe go a bit slower sometimes.",
                "He really did not know how to help students who needed additional help. There were many points where the class was lost, yet, he didn't know how to better explain.",
                "Be clearer/more consistent about the difficulty of exams. For example, questions on the midterm felt harder than the pset problems, but Tim had said they would be easier.",
                "Maybe talk about something different in the lecture instead of just doing proofs that we're just going to look at in the notes after class anyway. Maybe being more high–level in class would be good, and somehow getting people more involved to stop people from falling asleep would be good too.",
                "n/a",
                "Sometimes it got a little too abstract. I think more concrete examples would help me understand a little faster.",
                "While Tim is great, I thought it was a bit odd that he gave his different sections different exams and wasn't clear if he was going to grade our sections separately. While the mean was overall similar, the median was around 3 points different (out of 40), so it was like 7 points different, and it felt unfair to some students because one exam could have been easier for one person than someone else. Based on any class I took at the university before, if there are different exams, there needs to be different scales per section since it is not an accurate measure to scale these sections together. While I see why he gave the sections different exams since one was a few hours after the other, I feel like most large classes usually find a night time that works for everyone to take the exam at the same time. Possibly he could do this? I think Discrete Math exams happened that way the year before when there was only one instructor.",
                "",
                "Other than this, Tim was great, and he was very responsive/open to feedback about this!",
                "i really could not think of anything"
            ],
            "What aspects of the TA's teaching contributed most to your learning?": [
                "Office hours were helpful and there were a good amount of them",
                "N/A",
                "Led discussion section and office hours"
            ],
            "What could the TA modify to help you learn more?": [
                "Bruno was great. Can't complain",
                "N/A"
            ],
            "Other course elements not mentioned above:": [
                "TA led Discussion Sections"
            ],
            "Please comment on the level of difficulty of the course relative to your background and experience.": [
                "I had already taken Analysis, so the difficulty of the proofs was not bad; I honestly wish I would have taken this course BEFORE (or concurrently while) taking Analysis, as it provides a great introduction to logic and proof writing",
                "I had some background in proofs classes which helped",
                "I had no math background except for math 150s so the proofs were hard for me but I think this class helped me learn them",
                "Not hard, not easy (coming in with not much more than 152 calc)",
                "This course ended up being quite achievable to someone whose highest math class was 153.",
                "Difficult for students without a strong proof background",
                "As a CS major with limited experience writing proofs, this class had a steep learning curve at first. However, it was relatively manageable, and became easier as the quarter progressed.",
                "I'm bad at math but this class really wasn't too bad––very reasonable and pretty interesting once you get to combinatorics",
                "It was very approachable even for people like me with a less proof focused math background"
            ]
        }
    },
    "8": {
        "course-section": "CMSC 27100 3",
        "instructors": "Timothy Ng",
        "quarter": "(2238) Autumn 2023",
        "comments": {
            "What are the most important things that you learned in this course? Please reflect on the knowledge and skills you gained.": [
                "Some concepts in definitions of natural number calculation, sets, combinatorics, graph theory, and probability.",
                "Mathematical Proofs",
                "Learned how to do formal math proofs and many different topics that could be proved this way.",
                "Proofs, number theory, graphs, combinatorics, probability.",
                "Building the foundations of course material via proofs was extremely helpful",
                "How to do proofs using a wide variety of topics; modular arithmetic, combinatorics, graph theory, and more.",
                "Graph theory was the most important part in my opinion. The beginning of the course was logic, and the end was a bit of probability, both of which I've seen in other courses before, but graph theory was new.",
                "proofs",
                "Various proof techniques including induction and proof by contradiction, and applying these techniques to prove properties about basic arithmetic, modular arithmetic, basic graph theory, combinatorics and probability.",
                "proofs, combinatorics, counting, modular arithmetic, graphs, probability theory",
                "Basic combinatorics, probability, graphs, and the fundamentals of proof.",
                "combinatorics, graphs and trees, induction, number theory",
                "I learned how to write proofs and think critically in a mathematical context, I learned about division rules and prime numbers, modular arithmetic, combinatorics, graph theory, and probability theory.",
                "How to write up proofs and solve logic problems.",
                "Overall: how to construct a proof.",
                "More specifically: proof by induction, contradiction, general proof, combinatoric proof.",
                "Supplementary topics: prime numbers, division and divisors, set theory, modulus, combinatorics, graphs, probability.",
                "Induction, Combinatorics, Probability",
                "An overview of discrete math (there was a surprising amount of topics covered, albeit without much depth) and proof writing."
            ],
            "Describe how aspects of this course (lectures, discussions, labs, assignments, etc.) contributed to your learning.": [
                "Different concepts are covered in the lectures, and we can practice those concepts in the discussion sessions and weekly homework.",
                "Online lecture notes were amazing",
                "Lectures and PSETs were helpful in gaining understanding of the material. Discussions were also great as they went through step by step how to approach problems. Similarly, office hours with TAs and the prof were great too.",
                "Lecture was incredibly helpful. Ng's lecture notes are amazing. Weekly quizzes incredibly helpful for reviewing what I need to learn. Psets short and quickly returned.",
                "Prof Ng's lectures were very very good. The pace was perfect. Discussion sections were mildly helpful.",
                "N/A",
                "The lectures were really great. The professor talks very clearly and explains things incredibly well. He's pretty easy going and takes questions all the time. Great guy",
                "problem sets",
                "Lectures and lecture notes were very helpful. I'm not going to lie, though, this class was extremely hard for me and I suspect for lots of other people. Homework assignments and tutorial sort of helped by providing more experience with proofs.",
                "lectures were very succinct and informative. prof ng's notes were also amazing",
                "Lectures and discussions were great. Professor Ng is a great lecturer. His online notes were also extremely helpful.",
                "Professor Ng is an excellent lecturer, and he is always willing to answer questions. He also probably publishes on his website the most thorough lecture notes I have ever seen. Discussions were also helpful in making sure I stayed on top of the material.",
                "online lecture notes and quizzez",
                "I felt that the lecture notes were very thorough and did a good job of explaining the content. Tim is a great professor lecture–wise, it's just hard to keep up with everything in lecture. Discussion sections were interesting but I didn't like how they separated material we needed to learn from lecture and were just additional hours of lecture–type material. I felt that the quiz system was good in that it gave us exposure and forced us to learn material each week, but it also felt like a lot of unnecessary stress each week. Plus, I get that it's only positive–counting (it can only help your grade), but that means the exams could get away with heavy proof problems since the quizzes tested numerical problem solving questions.",
                "Lectures contributed a significant amount. Discussions, not so much. The class has short (like 10–15 minute) weekly quizzes that force you to stay on top of the material. They're graded a bit harshly (only 4 points with no partial credit), but usually aren't too difficult. Homework was great for practice in proofs, and this class was one of the only times in my life I've thought there were maybe too few problems on the homework (although prof. Ng did do a good job of including a number of extra practice problems for students with more time).",
                "The course was very well organized. Professor Ng also posts extremely useful and clear notes online that help solidify the knowledge, and has a pretty clear and helpful grading system that allows you to put the work in. The only thing I would note is that the exams can be a little challenging in terms of preparation because they are a bit more proof based than other aspects of the course (except homeworks) and it is a little hard to find good material to study from.",
                "Timothy is a great lecturer. I absolutely enjoyed all of his lectures and I highly recommend anyone to consider enrolling in his section",
                "Lectures were well structured and having all of them clearly typed up on Professor Ng's website was very helpful."
            ],
            "Additional comments about the course:": [
                "Be prepared for the exams: you shall know how to prove theories and how to use theories. However, the FRQs are not graded like 0–or–100. You can still receive half of the credits if you made a wrong proof but have demonstrated that you had some understanding of the question.",
                "Professor Ng is a great instructor and really willing to help you understand the material. Grading was very clear and fair.",
                "Ng is the best professor I've ever had in my life (granted, only my second year of courses at UChicago). Accessible, helpful, and an overall great guy. His lecture notes are great and his lectures are amazing.",
                "Prof Ng, along with the TAs, provided excellent, thorough feedback. In this class, I really understood the standards for success, and Prof Ng rewarded us greatly for fixing previous mistakes.",
                "Ng is a great lecturer, and the course was structured really well, but none of that could ever change the fact that the course content (in my opinion) was just incredibly hard to understand and use.",
                "Great class. The material is also super interesting.",
                "This is a fantastic introduction to proofs and Professor Ng did a great job of making it both accessible but also interesting!",
                "Honestly, there was a lot of different concepts we covered in this class and I'm still not entirely sure how each one integrated with the other. It felt a bit all over the place in terms of the actual content we covered. It was organized very very well, but I like knowing WHY we're learning what we're learning, and I don't see the connection to Algorithms just yet (or somewhat tangentially).",
                "Great class. At times, homework grading can be a bit nit–picky. Tests (especially the final) were pretty difficult, but definitely doable.",
                "The only thing I didn't like about this class is how little time we spent on the most difficult topics. The introductory material is discussed for way too long but combinatorics is only glanced through",
                "Just because people say discrete is easy doesn't mean you don't need to study. I screwed myself over on the weekly quizzes."
            ],
            "Thinking about your time in the class, what aspect of the instructor's teaching contributed most to your learning?": [
                "The whole class is quite important. But the most important and useful thing is that lecture notes given after class are really detailed. I can say that almost ALL the things that are mentioned in class (and also those that aren't) appear in the notes.",
                "The online lecture notes",
                "The way the professor explained things during lectures and office hours really helped with my understanding. Posting the notes online was helpful was well.",
                "Lectures and lecture notes – weekly quizzes were helpful",
                "The pace of the lectures was really good: not too fast or slow. He made lectures interactive, asking the class questions.",
                "I really appreciate Tim's course notes online. They are very thorough and make it so reviewing for exams involves much less friction.",
                "He's just a great lecturer",
                "ed responses",
                "Extremely well organized lectures and lecture notes posted online.",
                "prof ng is great at explaining things and very responsive on ed",
                "Tim is very very knowledgable about the subject material and is clearly very passionate about teaching. I appreciate how he structures his problem sets to test your critical thinking skills while still balancing the ability to get office hours help and resubmissions. I appreciate that the grading system is somewhat forgiving / cool, but I was very confused as to exactly how it worked. Otherwise, Tim had a lot of Office Hours and was very organized in his lectures and in his course page, which I greatly appreciated. I always felt like I could understand the course material, even though it might have been difficult at points.",
                "Professor Ng was one of the best professors I've had at UChicago. He was interesting, super friendly, very concise, and pretty funny when he wanted to be.",
                "Really taking the time to answer everyone's questions and posting his course notes online was very helpful."
            ],
            "What could the instructor modify to help you learn more?": [
                "N/A. Though I do hope I can find a way to come up with a solution when I have no idea :( The homework was a bit too harsh for me, though the midterm exam was not that brutal.",
                "Not much",
                "Maybe have more example proof would be nice and posting discussion tutorial answers right after doing them may have been helpful.",
                "Nothing",
                "His grading scheme is a bit strange. I think it warps incentives some, although ultimately it's fairly generous.",
                "more practice material that is similar to the exams",
                "Answers to practice exams. More graph theory, less combinatorics and probability [ it's too hard :( ]",
                "although prof ng provided many practice problems, i think the homework assignments were a bit too short and easy",
                "Nothing––Professor Ng is fantastic!",
                "Tim is a great instructor; nothing really",
                "I think the fact that Tim is so knowledgable about the subject can be a bit of a drawback considering he might not understand why we don't understand a subject sometimes? I found the quizzes to be fair but it was additional stress each week that I don't think was necessary. I would have preferred he just added a few more questions to the problem sets of these short–answer calculation style and maybe limit the number of resubmissions to balance out the grading scheme instead of having a quiz every single week. I thought that it's kind of weird to have unlimited resubmissions on homeworks, as for people who aren't good at test–taking but are good at understanding and explaining material in a homework context, homeworks are your chance to do well and the unlimited resubmissions just cancelled this out. And the quizzes were just \"you're right or wrong\" kinda deal, which can be very rough. The exams were time–sensitive too, I would have appreciated one less problem on the final exam to give us a chance to work through things.",
                "",
                "Tim is a very very smart and passionate professor, and I definitely think this is one of the better courses I've taken, I just think it might be a little too well–thought–out for its own good with the abstract variable grading scheme and such.",
                "Not much – I think the quizzes being only 4 points with no partial credit was a bit harsh.",
                "I wasn't a fan of the weekly quizzes, I felt like they were stressful and didn't really add to my learning."
            ],
            "Please include the name of the TA/CA/Intern you are evaluating. What aspects of the TA's teaching contributed most to your learning? What could the TA modify to help you learn more? Please include any additional feedback for the TA/CA/Intern.": [
                "(I don't know the name of the TA because it was not given anywhere.) She led the discussion session and provided explanations on discussion questions. I think the professor can give TAs the standard answer such that we don't need to worry about if the same answer may not be considered convincing enough during the exam.",
                "Jacob was great during discussion sections for explaining things and answer questions on the homework. I guess I just wish the chalk in the room was better as the writing on the board was hard to see sometimes.",
                "TA was good",
                "I personally did not gain very much out of tutorials. Not the TA's fault, to be clear.",
                "Jacob was so knowledgable and amazing. Love him.",
                "Discussions were usually a review of the lecture material, but 15 minutes were dedicated to the quizzes. I think they're probably more useful in other discrete classes where the professors are a bit more confusing or the homework is more difficult."
            ],
            "Other course elements not mentioned above:": [
                "Weekly quizzes/discussion was good to see where you are at with the material"
            ],
            "Please comment on the level of difficulty of the course relative to your background and experience.": [
                "This is a math class, so it is a little difficult for a CS student without any mathematical background in this field (like me)",
                "The course is easy if you have a strong competition math background",
                "Pretty hard with basically no knowledge in math (haven't done a proof since high school). I do think that if I had practiced and studied more it probably would've gone a lot better. Discrete just feels very different from anything that I've done, the concepts were difficult but the prof did a good job.",
                "No proof experience before. Ng presented it well, so I learned quickly.",
                "As a Computation and Applied Math major, this course was relatively easy compared to my other math and CS classes. With a strong background in proofs, I felt ahead of the game.",
                "Not too bad even for students with minimal experience with proofs",
                "Having taken MATH 160's and Analysis, this course was easy. If you've never taken a proofs class, I can see it being pretty difficult, but the professor does a great job so it shouldnt be too bad",
                "Hardest class I've taken at this school by far. I cannot stress enough how difficult this class is.",
                "Fair",
                "Very doable as a math major, though the quiz format can be tricky as no partial credit can be given if you make a mistake. However, the points missed in quizzes could be recaptured by the final exam, so that we weren't punished very much for mistakes there.",
                "Can be a bit difficult if you have no proof experience –– I had proof experience and found it challenging at times.",
                "I have had no previous experience with proofs other than geometrical proofs in my 8th grade geometry class (I hated them). This class was very beginner–friendly and honestly positively changed my view on, and interest in proofs in mathematics.",
                "Not super hard, though this was the first time I was introduced to proofs.",
                "This course wasn't difficult, but let me say this. A) People definitely overrate how easy it is. If you've not had experience with proofs or aren't a math major, you will struggle at times. B) Just because it's not difficult doesn't mean you don't need to study. Maybe this is obvious to people, but even though I understood the lectures, I did very badly on the weekly quizzes because I didn't study. At the end of the course when I crammed for the final, I looked back at the quizzes and found them to be very easy. Don't do what I did lol"
            ]
        }
    },
    "9": {
        "course-section": "CMSC 27100 4",
        "instructors": "Timothy Ng",
        "quarter": "(2198) Autumn 2019",
        "comments": {
            "What are the most important things that you learned in this course? Please reflect on the knowledge and skills you gained.": [
                "We learned the basics of logic, number theory, combinatorics, and probability.",
                "My skills in combinatorics and probability were strengthened",
                "After taking (and nearly failing) the 160's, I had major math anxiety and felt totally incapable of writing a proof but now I feel very comfortable writing proofs and working out problems on my own",
                "Discrete Math",
                "The fundamentals of discrete mathematics.",
                "Formal Logic – interesting, but sort of unnecessary",
                "Set Theory – fine",
                "Number Theory – dragged on, but was interesting",
                "Induction – I don't think we needed three lectures on it, but it was useful",
                "Combinatorics – useful, semi–interesting",
                "Probability – useful, semi–interesting",
                "Graph Theory – bordered on being cool, but we didn't get to any meaningful results passed definitions. I learned more about graph theory in CS152",
                "Recursion – touched on some neat topics but never really engaged with them",
                "Number theory, combinatorics, probability, graph theory, and how to write proofs were all interesting and useful topics.",
                "Graphs, probability theory, combinatorics.",
                "Learned about the basis of discrete math and how to prove concepts in the class",
                "Basic discrete math topics, with a sampling from multiple topics (graph theory, probability, number theory) etc.",
                "Theory (ie number theory, graph theory)"
            ],
            "Describe how aspects of this course (lectures, discussions, labs, assignments, etc.) contributed to your learning.": [
                "The lectures were pretty easy to follow and all of the notes were posted online so if you missed a class it was easy to follow along since most if not all of the info was online. The assignments were 4–6 problems per week which wasn't too bad.",
                "Professor Ng was generally pretty good at using the whiteboard and facilitating participation in the classroom",
                "The lecture notes online were amazing and I did fine without really going to lecture or discussion sections. The assignments reinforced the concepts we were learning very nicely, didn't seem irrelevant or anything",
                "The teacher left really comprehensive notes on his website that were truly the most helpful part of this class.",
                "The lectures were good for getting a feel for the types of problems to expect.",
                "Tim's lectures were phenomenal – he's a great lecturer and explains things quite clearly.",
                "Discussions sections were occasionally helpful, mainly when extra problems were given for us to do. Assignments were incredibly helpful for learning the material. Lectures were very clear and well organized, and they contributed greatly to my learning.",
                "Ng's lectures were incredibly clear, the homeworks and tests were fair, and closely related to the material we were learning. Definitely learned a lot in this course.",
                "The lectures were very helpful, and the Professor Ng posted lecture notes online which helped me study outside of class",
                "Lectures by Professor Ng were very useful and clear, and he would also upload notes in a prompt fashion to the course website. He frequently provided examples to illustrate applications of theorems. TA discussion sections (as well as office hours) were also very helpful with tackling homework problems. Assignments were usually manageable and provided more intuition for a variety of topics.",
                "Lectures were thoughtful, clear, concise, and funny (which is very hard to do for a math lecture"
            ],
            "Additional comments about the course:": [
                "The course material is very interesting if you are interested in exploring math or the fundamentals of CS math a little more.",
                "Tim is a very good instructor. He made it worthwhile to take the class."
            ],
            "Thinking about your time in the class, what aspect of the instructor's teaching contributed most to your learning?": [
                "Tim's lectures are clean and easy to follow since he labels the definitions, theorems, and examples he uses and if you missed anything it would be online after the class for reference. His notes made the assignments way more coherent and easier to complete.",
                "He knew fun facts about mathematicians and computer scientists that perhaps made some of their theorems easier to memorize",
                "Ng is a clear lecturer uses good examples and answers questions well. excellently organized",
                "The online notes were really very thorough and extremely helpful. It relieves the stress of having to copy down every single thing in class freeing you up to actually pay attention to the lecture. Additionally, the organization of the notes just made working through the homework so much more manageable.",
                "I liked how he'd come up with examples and scenarios to demonstrate the problems we had to do instead of treating it as completely abstract. He was always super prepared and easily answered all questions.",
                "Lecture notes – posted online after every lecture, VERY clear. Made catching up / reviewing very easy",
                "Problem sets – interesting problems, not too time consuming, not just book problems",
                "My instructor was super organized, which is always very important to me. He also spoke clearly and never rushed through complicated topics. The notes that he posted online after each class were also perfectly clear and very helpful.",
                "The lecture notes are a great resource.",
                "The clear lectures, and well made lecture notes.",
                "His lecture notes and examples",
                "Professor Ng was very clear in his lectures. He also stopped to ask questions for anything covered in class. Before midterms and finals, Professor Ng dedicated ample time in class to review any topics that students might be unclear on. His lecture notes were also very useful, especially if you had to miss a class/got confused on any particular topic.",
                "Fast paced but instructor was clear and always willing to accomodate our questions",
                "Strong examples"
            ],
            "What could the instructor modify to help you learn more?": [
                "Nothing.",
                "It would be nice if the two sections were more in sync with one another so that you could attend any section and not get confused. But I guess the online lecture notes were supposed to account for this.",
                "Tim was great but I often felt like class was simultaneously a little too slow and a little too fast. Students were generally not so engaged with the lecture.",
                "",
                "I think Tim really tried to give helpful examples. Early in the quarter I think a few more examples would've been helpful but the second half was really fine.",
                "Nothing.",
                "Harder problem sets",
                "There were a few times when more examples of how to apply the theorems we learned would have been useful, specifically for modular arithmetic, but generally I would not change anything.",
                "Nothing",
                "Maybe doing a little bit more practice problems in class. Sometimes it felt like we were just speeding through definitions and theorems, and not actually trying them out.",
                "More examples in class that would resemble the homework problems",
                "NIL"
            ],
            "What aspects of the TA's teaching contributed most to your learning?": [
                "There were discussions where you could ask the TA about homework questions.",
                "Bruno hosted extra office hours before the midterm which was nice",
                "Discussion was helpful.",
                "The extra problems that we were given during discussion sections were useful.",
                "The two TAs provided regular office hours and guided students on homework problems if they encountered any difficulties."
            ],
            "What could the TA modify to help you learn more?": [
                "NA",
                "Faster grading on the psets",
                "Having a better plan for what to do during discussion sections could have made them a bit more interesting and helpful.",
                "The discussion sections were mostly redundant since all they did was reteach some concepts from class. Would have been better if they just went over homework problems or something."
            ],
            "Additional feedback to the TA/CA/Intern:": [
                "There were a few different TA's that rotated through discussion and they were all very helpful.",
                "I interested with him once"
            ],
            "Please comment on the level of difficulty of the course relative to your background and experience.": [
                "It was pretty easy even without much experience with proofs",
                "having taken cs154 and math 159, the lectures on logic and how to write proofs were pretty much review for me but everything else was manageable",
                "it wasn't as hard as i was expecting if you don't cheat on the psets you'll get it and do fine",
                "It was really doable",
                "Easier than I was expecting, but still not the easiest course.",
                "fourth year math major – easy",
                "This class was not too difficult having taken an introduction to proofs class and generally enjoying math classes.",
                "Coming as math major it was not that bad. I had seen some of the topics before but most were new to me.",
                "This class was very manageable, even though I had never taken a proof based math class before. The highest math I took before it was 195 and 196, but it was still really easy to follow along.",
                "The course was not difficult if you have taken a math class that involves proofs before.",
                "Relatively manageable with sufficient math background",
                "Not very difficult given my background in math"
            ]
        }
    },
    "10": {
        "course-section": "CMSC 27200 1",
        "instructors": "Timothy Ng",
        "quarter": "(2204) Spring 2020",
        "comments": {
            "What are the most important things that you learned in this course? Please reflect on the knowledge and skills you gained.": [
                "Understood different algorithm paradigms.",
                "Proving correctness/efficiency of algorithms. Stable matching, scheduling, graph theory, dynamic programming, NP–completeness, network flow, and a lot more.",
                "The different types of algorithms, how they work, what their advantages/disadvantages are and the situations each should be used in.",
                "We learned about algorithmic design and analysis. It was very proof–based and theoretical.",
                "How to design algorithms and prove their correctness and efficiency",
                "Algorithm design principles and analysis",
                "How to analyze famous algorithms and adapt them for our own use",
                "different types of algorithms and how to analyze time complexity, writing proofs for algorithms",
                "Algorithm design paradigms, how to write proofs within the realm of complexity theory.",
                "graph theory",
                "proofs, important algorithms, how to prove/write algorithms, main algorithm strategies",
                "different algorithm styles, analysis, and problem solving",
                "The different types of strategies for solving computational problems, many concrete examples.",
                "Types of algorithms! Type of decision problems! Proof writing!",
                "Different programming paradigms: Greedy Algorithms, Dynamic Programming, Divide and Conquer, Flow Networks, some Data – Structures, proving the correctness of algorithms, analyzing runtime.",
                "Fundamental algorithm techniques, problem classification.",
                "I learned the different types of algorithms and when to use which",
                "How to analyze algorithm",
                "You learn about a lot of base algorithms that are useful in tackling more general problems.",
                "Algorithms: Greedy, Divide & Conquer, Dynammic Programming, Intro to Graphy Theory, and P–NP problems",
                "How to approach designing an algorithm and analyzing its time and space complexity."
            ],
            "Describe how aspects of this course (lectures, discussions, labs, assignments, etc.) contributed to your learning.": [
                "Video Lectures and lecture notes were clear. Office Hours helped clarify things a lot.",
                "Professor Ng posted videos of his lectures on canvas, posted lecture notes on the class page, was very responsive and helpful on Piazza, and held OH during the class period over Zoom. The amount of help that he offered was really helpful considering the circumstances.",
                "Online lectures were recorded and asynchronous, very organized and helped explain material. Detailed lecture notes were also provided and very helpful. Assignments were weekly, decently time consuming but put the topics we discussed into practice.",
                "Tim's lectures and lecture notes are fantastic. The assignments were useful for solidifying understanding of the concepts.",
                "Lectures were great in introducing material, I enjoyed knowing some of the motivations behind problems we learned about. PSETS were well designed to reinforce lecture material.",
                "Pre–recorded lectures were all of the learning",
                "lecture notes were very detailed and helpful, the recorded lectures were also good to see examples and walk through them",
                "Lectures and the posted lecture notes are all you need.",
                "lectures were very helpful and lecture notes were super detailed and made it very convenient to go back and review",
                "prerecorded lectures with lecture notes were really helpful and clear",
                "lectures were prerecorded and notated nicely, synchronous class time was used for office hours which was nice (but early for me), and psets were due each week on the material.",
                "Lecture video and notes were and easy to follow.",
                "Online Lectures + Assignments, there were very detailed notes available that covered the information in the lectures, office hours were offered as well. The lectures were very clear, and helpful, they related closely to the homework assignments and exam. Communication over piazza was good if any of us had questions we would usually receive the answer pretty quickly.",
                "The lecture notes were extremely helpful",
                "The professor provided wonderful lecture notes. The lecture videos were also well done. He provided many office hours over Zoom that felt very accessible.",
                "The cours consisted of recorded lectures, weekly problems sets, and a take–home final."
            ],
            "What aspect of the instructor's teaching contributed most to your learning?": [
                "Office Hours",
                "His lectures were very clear, he used a lot of examples, and he was very responsive and helpful on Piazza.",
                "He was always super clear with his instruction, available online for questioning and made the class very easy to follow along with from remote.",
                "Fantastic lecturing and attentiveness to students. Tim is a really great communicator!",
                "Very nice guy, very accommodating for the challenges of the online quarter, very good at explaining concepts, had very good lecture notes, had well designed PSETs, had good solutions to PSETs.",
                "He taught the course well given the remote nature",
                "lectures were pretty clear and psets were reasonable, office hours were sometimes a bit vague but were usually helpful for clarifying things",
                "Tim is an amazing teacher. He posts in–depth lecture notes to his already lucid lectures. He was available consistently (at least 3 times a week) and is very clear in his answers to questions. He is the type of teacher that makes you care about the subject he teaches which is certainly in part due to his excitement about the topics. He also really cares about how students are finding the course/whether they are meeting their goals.",
                "lectures were clear and lecture notes were very helpful",
                "very understanding, made his course as accessible as possible",
                "Professor Ng was good at explaining concepts through both notes and examples",
                "Prof was awesome. Lectures were great and good sense of humor. Vouch",
                "Tim was very well organized and approachable. He explained things clearly and was available outside of class (piazza) to explain concepts and help clarify questions we had.",
                "He was very organized and responsive",
                "Great at teaching, unique grading policies",
                "Tim is fantastic. His lectures were thorough and well–planned. Office hours were awesome and he held them dilligently even when very few people attended. And piazza answers were clear and prompt.",
                "Professor Ng was fantastic. His lecture notes were comprehensive and engaging. He is clearly a very brilliant theorist, and this shows in his lectures. He was always on top of Piazza and Zoom office hours. The grade scheme was very unique and forgiving––it allowed us to recover from one (or even several) poor PSet performances. Finally––he cracked subtle jokes here and there that made lectures engaging.",
                "Tim had a ton of office hours and was incredibly organized. His lectures were great and I learned a lot in the class."
            ],
            "What could the instructor modify to help you learn more?": [
                "Be more clear during office hours; talking in generality loses focus",
                "nothing",
                "N/a",
                "Give optional related problems in the weekly psets, since there are only three problems each week.",
                "Nothing",
                "Nothing.",
                "honestly nothing else he could do, this class was really well organized and plenty of office hours/Piazza help",
                "he was sometimes vague when answering more specific questions",
                "Nothing really",
                "I thought the final was unreasonably difficult and overbearing given the circumstances. While the grading scheme was forgiving, most people I talked to spent upwards of 20 or 30 hours on the final, while most other classes reduced workload or cancelled finals altogether due to the pandemic and protests.",
                "Really nothing; this was an incredibly well–run class.",
                "Nothing. Professor Ng was a wonderful professor who made theory accessible for those who don't like while at the same time challenging those who enjoy mathematical proof. I felt like I understood exactly what was expected from me in order to succeed in the course.",
                "Often problems were lengthy and confusing and his answers to questions on Piazza or in office hours weren't super helpful."
            ],
            "Please include the name of the TA/CA/Intern you are evaluating.": [
                "Aritra",
                "Akshima and Aritra Sen",
                "Aritra"
            ],
            "What aspects of the TA's teaching contributed most to your learning?": [
                "He was very clear and helped us work out issues on problem sets.",
                "Homework feedback",
                "Aritra was really helpful during office hours and helped to clarify a lot of topics"
            ],
            "What could the TA modify to help you learn more?": [
                "Be more clear with why they deducted points"
            ]
        }
    },
    "11": {
        "course-section": "CMSC 27200 2",
        "instructors": "Timothy Ng",
        "quarter": "(2214) Spring 2021",
        "comments": {
            "What are the most important things that you learned in this course? Please reflect on the knowledge and skills you gained.": [
                "Calculating runtime complexity for algorithms, how to use different algorithms to solve problems.",
                "I learned how to mathematically analyze algorithms. I also learned a lot of popular algorithms like Dijkstra's, merge sort, etc.",
                "greedy algorithms, stable matching, dynamic programming, reductions, bipartite matching, djikstra's algorithm",
                "How to approach divide and conquer and dynamic programming algorithms, how to analyze algorithm runtime formally and write correctness proofs, what NP–complete problems refer to",
                "I feel I have gained a lot in terms of thinking about optimisation and reducing a problem to another",
                "Algorithm design, problem–solving, and different techniques to approach problems efficiently",
                "The way of thinking and approaching various problems using different kinds of algorithms such as greedy, divide and conquer, and dynamic programming.",
                "Greedy algorithms, divide and conquer strategies, dynamic programming, network flow problem, and techniques for reducing to other problems.",
                "You take a systematic approach to solving problems by learning about different types of algorithm, their runtime and correctness. I really appreciate the problem solving skills that I gain out of this class as it makes my brain more systematic when dissecting a problem, and definitely helps in the long run",
                "Learned about how to diagnose problems and choose which algorithms most efficiently solve them. In particular, learned about greedy algorithms, divide and conquer solutions, dynamic programming, proving if something is polynomial–time solvable or not...",
                "I think the main takeaways for this course were the various algorithms that we could use to solve a variety of problems, as well as the different techniques used to prove that a given algorithm solves a type of problem. If explaining it to someone else, I would explain some of the algorithms detailed throughout the course first, before pivoting to the different proof styles we learned to prove those algorithms work. Finally, I'd explain a bit about time complexity analysis.",
                "this class teaches you about different methods for approaching problems, proving the correctness of algorithms, and doing complexity analysis. There was a lot of focus on greedy algorithms, divide and conquer algorithms, dynamic programming, network flow problems, and reductions for NP–hard problems.",
                "Greedy Algorithms, Divide and Conquer Algorithms, Dynamic Programming, Recursion, P vs NP, Reductions, Proving correctness",
                "Different algorithms, big O, interesting strategies used in optimizing time and space.",
                "Common patterns in algorithm design, proving algorithm correctness, intractability, reductions between problems",
                "That algorithms run almost everything in CS",
                "Dynamic Programming, Greedy Algorithms, Divide & Conquer algorithms, algorithms.",
                "The different ways of attacking programmatically–oriented problems and the tricks of each with regards to proving said approaches and their implementations.",
                "In general: greedy algorithms, divide and conquer algorithms, dynamic programming, network flow, reduction",
                "",
                "Some specific algorithms we learned: Gale–Shapley, Dijkstra's, Prim's, Kruskal's, Bellman–Ford, Ford–Fulkerson,"
            ],
            "Describe how aspects of this course (lectures, discussions, labs, assignments, etc.) contributed to your learning.": [
                "Professor Ng would livestream on Panopto during class times on M/W/F. We'd have a p–set due every Thursday at 8pm that was made by both Professor Ng and Professor Black.",
                "Professor Ng's lectures, and especially his lecture notes, were very helpful. I learned a lot from them. However, sometimes the PSet questions did not seem to connect to this material and were unnecessarily hard. The grading scheme made up for this, but it was discouraging to be unable to do 1 or 2 problems on a handful of PSets.",
                "lectures were really helpful. also Professor Ng's notes on his website were really helpful. Office hours were mostly very helpful depending on which TA/professor was there. Problem sets are helpful for learning if you go to office hours and work through the mindset of using the algorithms we learned",
                "Lectures were nice for introducing concepts, but problem sets truly tested if you understood them and could solve problems on your own.",
                "Synchronous lectures were very clear and helpful in learning new material",
                "Lectures were great in learning the concepts and problem sets, while difficult, were great at putting them into practice.",
                "Lectures were very good for introducing new topics, seeing examples, and giving us tools to use on assignments. Assignments let us practice these tools, and helped us expand beyond the examples from class.",
                "Lectures and office hours help tremendously. The assignments, although very challenging, are really good and help fortify your understanding.",
                "Recorded lectures were extremely clear and office hours were every helpful. I really liked the music that Professor Ng would put before each recorded lecture!",
                "We had weekly problem sets, no midterm, and 1 final. I loved the grading system because any points you lost on the problem sets just got added to the weight of the final so you had the opportunity to gain them back!",
                "The lectures gave a great introduction to the topics, weekly homework assignments gave us a chance to apply what we had learned. (the extra credit reflections were also just a nice way to communicate any issues we were having)",
                "Lectures were clearly laid out and followed a clear schedule of content. Additionally, Professor Ng's lecture notes were incredibly helpful, although I was not aware of them for the first few weeks.",
                "Lectures informed me on the topics and psets put it to practice, though I sometimes felt there was a disconnect.",
                "Lectures were very helpful; synchronous attendance wasn't necessary because the videos were streamed and saved on Panopto, and the lecture notes were detailed and easy to understand",
                "The lectures were nice and the TAs were CLUTCH!",
                "Lectures were super helpful, but the real learning happened while doing problem sets and in office hours.",
                "Lectures, though vaguely interesting, did not in any way shape or form prepare students for the PSets.",
                "Lectures were really good, as were the lecture notes Professor Ng posted online! Assignments helped solidify the topics really well."
            ],
            "What aspect of the instructor's teaching contributed most to your learning?": [
                "Professor Ng explains complex concepts very clearly, and I was able to follow along almost all of the lectures without any issue.",
                "Professor Ng's lectures and notes contributed the most.",
                "Professor Ng's lectures and notes were the most helpful",
                "Ng was a good lecturer and had helpful lecture notes. I enjoyed the asynchronous Panopto video format of the lectures for watching them on my own time, though it was difficult to ask live questions. He also gave interesting responses to our reflections, and it was clear that he cared a lot about the class.",
                "Lectures were unbelievably helpful in understanding intimidating material, and his passion for the concepts was evident in his teaching.",
                "Professor Ng is a great lecturer; he explains difficult concepts very well and clearly enjoys the topic he's teaching. His lecture notes are extremely useful for going back and reviewing certain topics.",
                "Professor Ng is good at introducing new topics and explaining how examples work. He was also helpful answering questions on Ed.",
                "Ng's office hours is really great, he just doesn't simply give away problem set hints but actually guides you to the right way of thinking about the problem, which is very valuable.",
                "Very clear, thorough lectures. Ng is extremely knowledgeable about the subject and his lectures are top–tier.",
                "Lectures",
                "Professor Ng is a very clear lecturer. He clearly knows a lot about the topic and is able to clearly explain it at an appropriate level. His lecture notes are INCREDIBLE!!!!!",
                "Having class be able to be rewinded during class itself, it combined the best aspects of asynchronous with the best access of synchronous, although it would have been really helpful (I think its a platform limitation) for us to be able to ask questions while not being exactly at the live point.",
                "Lectures were good, psets were definitely challenging.",
                "Prof Ng was very good at walking us through the thought process of coming up with approaches to design or prove an algorithm; lectures were well–made and also interesting with occasional background info on the history and development of the theory we learned",
                "Professor Ng is a really smart guy and has a nice website that lays out all the notes for each class",
                "Office hours and the notes that he posted before class and the recorded videos he posted after class.",
                "Their OH were more useful than lecture itself with regards to bing successful in the class despite the more interesting nature of the lectures.",
                "Professor Ng explained things extremely well. He introduced topics in a very intuitive way and wrote very clear notes."
            ],
            "What could the instructor modify to help you learn more?": [
                "The p–sets for this class were kind of questionable. Many of the problems were not helpful to better understanding lecture content, and required us to complete problems well above the complexity of what we were taught. I believe the most difficult problems were Professor Black's, but there were multiple weeks where even TAs were having a hard time solving the problems (there was one week where none of them knew how to solve Prof. Black's problem).",
                "I believe this was not necessarily within Professor Ng's control, but given that students had been struggling with the level of difficulty, I really wished that the professors had had some conversation about this to make the p–sets more reasonable.",
                "A bit more help on the PSets would have helped me learn more. I went to office hours a couple of times and found that they just did not help me figure out the questions.",
                "I didn't like how we couldn't ask questions verbally and had to type them in the panopto chat",
                "Make problem sets more correlated with the lecture material rather than taking classic algorithm problems and asking us to solve them without much guidance. It would also be helpful to walk through the process of solving/proving more problems in class, particularly in the sections involving greedy algorithms and divide and conquer.",
                "I felt that the psets could have been made a bit easier, there were several times the TAs themselves were confused or gave the wrong answers. While several of the problems",
                "None",
                "Most problem sets were difficult but doable. That said, some of the problems in the psets were extremely difficult to the point where TA's couldn't figure it out. I think certain problems on psets could be better tailored for students who are learning algorithms for the first time.",
                "N/A",
                "Sometimes the lectures are proof heavy and for me, all proof feels abstract until I can see how the proof can help solve a specific example, but I guess the time constraint doesn't allow him to go over that.",
                "I think it would be helpful if Prof Ng could hold more office hours.",
                "I think that at times the grading schemes were slightly over–complicated (it was cute though).",
                "Make it a lot clearer how each week's content related to the homeworks. For a lot of the homework problems just the first step of figuring out how to approach the problem at a high level was very difficult, and I spent a lot of time that ended up being useless just trying things to no avail. So, it would be really helpful if there were guidance on how to approach a problem or hints about them more often",
                "Office hours was a necessity, I couldn't do a single pset without going multiple times. There was also sometimes a disconnect between lectures and psets and that was really time–consuming for me to play catch–up.",
                "Simplify concepts a little more some stuff that was assumed were stuff I didn't get",
                "Timothy Ng was awesome!",
                "Assign Psets more in line with the material covered in class.",
                "Nothing, he was great!",
                "I think the course could really benefit from making the expectation that psets were intentionally really difficult and would not be indicative of the difficulty of the exam clearer"
            ],
            "Please elaborate on the above.": [
                "Lectures were good, PSets were at many points too hard. They took way too long and I still did not do well on them. We have a take home final, and I am honestly scared for the first time ever that I might fail a class. The final is a huge percentage of our grade (over 50% for me), but we can't know our grades before we decide to pass/fail. It is all around very nerve wracking.",
                "Zicheng's office hours were the GOAT",
                "The problem sets were often significantly more difficult than the lecture material and required either hours of thinking or consultation of other sources to fully solve. There was even one problem where the instructors and TAs admitted was very difficult, and pset grades averaged 60–80%, though the grading scheme luckily allows for the final to count for the entire portion of the grade. At the same time, the final was *very* long, to the point where it was not expected that we solve all of the questions, but the problem sets that preceded it helped ensure students were prepared due to the similarity of some problems.",
                "Weekly problem sets were quite challenging, but they were very helpful in forcing you to learn the material and apply it to real problems.",
                "Lectures were live–streamed rather than on a Zoom call, which was a bit restrictive for communication. There was a discussion panel on the side where we could type questions, but it was still not quite as good. The grading system for this class was overall pretty kind and reasonable. But, the expectation that not all homework questions will be answered, combined with eh fact that we didn't know any stats on how other students were doing on the homework until late in the quarter, made it really hard to judge how well we were doing in the class.",
                "Zicheng is one of the most dedicated TAs I've ever seen, he helps a lot when everyone is struggling with the pset.",
                "No timed exams, no midterms, just 1 take–home final paper, which we had 3 days to complete. The problem sets in this class are challenging but really help reinforce material we covered in lecture. I really appreciate the grading structure, which places a very high weight on problem sets, and gives you the chance to make up whatever points you lose in the psets, on the final.",
                "Zicheng was the GOAT TA at office hours – honestly saved my grade so many times.",
                "The lectures were great. They took place live and were recorded if students preferred to watch them later.",
                "Lectures were really effective along with the lecture notes provided. Additionally, most of the TA office hours (shoutout Zicheng) were really helpful, often more effective than those of the instructors. The final exam was very similar to homework problems and since we were allowed to look at our prior homework, was clearly related. My main critique is that the homeworks were not clearly building upon the content of the class, and also had a lot of unnecessary gotchas or weird specifications that made us spend more time figuring out edge cases than actual content related to the class.",
                "Again, there was a pset and lecture disconnect in terms of the material.",
                "The TAs saved me",
                "Professor Ng is amazing at simplify complicated concepts and I found his lectures and notes to be extremely helpful in my learning.",
                "The TA Office hours were the only real means of preparing for assigned work. Professor OHs were less useful due to a seeming inability for the professors to answer directly any question asked them.",
                "Lectures were very good. Problem sets were interesting and helped me understand the concepts a lot better. I didn't go to faculty office hours since the time wasn't very convenient for me, but TA office hours were very helpful (thank you, Zicheng!)"
            ],
            "Did the instructor make adjustments to the course mid-quarter? If so, please comment on the effectiveness of those adjustments.": [
                "N/A",
                "no",
                "N/A",
                "The course stayed for the most part the same. As stated above, the professors eventually released mean and median scores on the homework, which helped me evaluate how I was doing much better.",
                "n/a",
                "No",
                "N/A",
                "No, he didn't make adjustments because none were needed. He sent out weekly \"quizzes\" to get our opinions of the class and I'm sure he based his teaching off of that."
            ],
            "Please describe any element of this course, including specific actions by the instructor, that improved your remote learning experience.": [
                "This class was conducted very much like an in–person class, and I honestly think that was part of the problem. The PSets were just entirely too difficult to work on alone, but virtual collaboration is obviously difficult.",
                "Having the recorded lectures and notes were helpful for going back and rewatching to enhance understanding.",
                "I appreciated the large array of office hours",
                "Faculty office hours were invaluable in making progress on problem sets, as well as understanding the material on a new level.",
                "Providing lecture notes were extremely helpful and having lectures streamed directly on Panopto was very useful if I missed something during lecture.",
                "while I thought live–streaming lecture instead of using a Zoom call restricted communication some, the presentation tools available in this method were really well used. The whiteboard presentation worked really well.",
                "The TA office hours really helped with problem sets.",
                "Professor Ng's lecture setup coupled with his notes were super helpful, my only critique on this is to please make it more publicly known that they exist earlier! I only found out because a friend in the class told me to look at them and I had to search from there.",
                "Having live lectures that were also available recorded was nice.",
                "The website Ng had was very nice for referencing back to lecture"
            ],
            "Please include the name of the TA/CA/Intern you are evaluating. What aspects of the TA's teaching contributed most to your learning? What could the TA modify to help you learn more? Please include any additional feedback for the TA/CA/Intern.": [
                "Zicheng literally carried the class for me. I'm quite sure there were more students attending his office hours than the synchronous lectures for the other section.",
                "Zicheng was the most patient and helpful TA in this course. He helped me learn so much more about algorithms and he also was so passionate about algorithms. He put students first always and was super assertive during office hours which made them super structured and very productive.",
                "Zicheng Zhen; His office hours were phenomenal and helped make everything so much easier to understand. He truly cared about all of us and really wanted to help us succeed, and you could tell he loved what he was doing. I couldn't have asked for a better TA in this class.",
                "Zicheng Zhen was an absolute godsend for this class! He was so good at helping us with tough pset problems. He clearly enjoys the topic of algorithms and makes a strong effort to make sure we understand tough problems.",
                "Zicheng is so wonderful.",
                "Zicheng was extremely helpful, I don't think I would have been able to do nearly as well in this class without his guidance.",
                "Zicheng Zhen",
                "",
                "HE IS AN AMAZING TA. He really saved all of our grades – sometimes the wording would be horribly ambiguous but Zicheng would go out of his way to help us as much as possible and clarify the problem as best he could. He really made this course tolerable",
                "They gave us grades very promptly, but it was vague.",
                "Zicheng was very encouraging and helpful, both during and outside of office hours.",
                "Zhen was the best part of Algos. One of the best TAs I've ever had. Honestly the GOAT",
                "ZICHENG WAS THE GOAT. HE CARRIED THE CLASS EVERY TIME WE NEEDED HIM TO. HE'S A GOD AMONGST MEN AND MUST BE PROTECTED AT ALL COSTS.",
                "Zicheng Zhen was amazing. His office hours helped more than an entire section's worth of students to better comprehend the material and succeed in the class."
            ]
        }
    },
    "12": {
        "course-section": "CMSC 27200 3",
        "instructors": "Timothy Ng",
        "quarter": "(2222) Winter 2022",
        "comments": {
            "What are the most important things that you learned in this course? Please reflect on the knowledge and skills you gained.": [
                "I learned how to evaluate algorithms.",
                "I learned about how to look at what an algorithm problem is asking and configure my approach (and obviously, how to prove that I've found a \"good\" algorithm)",
                "Dynamic programming, greedy algorithms, divide and conquer methods, and flow networks. Super helpful for my coding abilities also to learn how to write in pseudocode and understand big O notation",
                "Various algorithms such as stable matching, dynamic programming, greedy, recursive. Bunch of graph theory and related algorithms, computational complexity",
                "matching, greedy, divide conquer, dynamic, NP",
                "Different kinds of algorithms",
                "Algorithms.",
                "How to think and solve algorithms",
                "Proof–writing for algorithms, time complexity, and general algorithm strategies: Greedy, divide and conquer, dynamic, network flow, and discussion of P and NP.",
                "How to break down and reason about problems in a formal way that allows one to develop intuition into solving them algorithmically.",
                "Graph theory, greedy algorithms, divide and conquer, dynamic programming, network flows, hardness.",
                "greedy algorithms, recurrences, Gale Shapley, Dijkstra, Kruskal's, NP completeness, etc. Dynamic programming, shortest path, min cut, overall a broad intro to many algorithms, especially ones focused on directed and undirected graphs, matching, and proofs of correctness + optimality",
                "time complexity, proving NP–completeness",
                "",
                "Different algo solving approaches:",
                "greedy algos, divide and conquer, dynamic programming",
                "how to write proofs for various kinds of algorithms",
                "How to write basic algorithms, and how to map them to other algorithms to show NP completeness"
            ],
            "Describe how aspects of this course (lectures, discussions, labs, assignments, etc.) contributed to your learning.": [
                "The lectures and problem sets are the main elements of this class. Tim is a great lecturer and his notes are incredible, especially later on in the quarter when you have to take notes on flow charts which are super annoying to copy down. The problem sets are tricky but not completely impossible.",
                "The lecture notes were really helpful at summarizing the concepts.",
                "Lectures were really good, I rarely had to read the textbook because of how well covered the material was in lecture.",
                "Lectures were clear and concise",
                "lectures and homework were useful",
                "Lectures, lecture recordings, and assignments are both really helpful",
                "The homework did a great job of reinforcing what we learnt in class. The lectures were clear and helpful to teach us the topics. Lecture notes were provided which were tremendously useful when working on assignments.",
                "Lecture notes were really helpful",
                "Psets were difficult but fair, collaboration was key to success for all of them. The midterm and final were basically the same as psets in every way, but were way too long. Midterm took me 5 hours to complete, as did the final, which is not reasonable given the other demands on students' time especially during finals.",
                "Lectures were incredibly helpful as Ng is a fantastic lecturer.",
                "Lectures were extremely helpful, as were Professor Ng's lecture notes. TAs mostly took questions during discussion sections and were generally helpful. Assignments could be tricky and time consuming, but were engaging.",
                "Professor Ng's lecture notes were really good, and office hours from the professors and the TAs really helped with the material",
                "Lectures and posted notes"
            ],
            "Additional comments about the course:": [
                "I did super poorly on the midterm (mostly my fault). Be warned that the exams are much much harder than the problem sets. I thought that I had prepared in the way that we were told to, and I still bombed it.",
                "Despite what I suspect some other course evals might suggest, we were clearly told exactly what was expected from us for our proofs on PSETS. However, around the midterm, grading slowed down considerably and I found it difficult to make improvements / adjust. (As well as frustration from not knowing my standing in the course)",
                "This was my favorite class this term, thanks!",
                "I felt a lot of the stuff we learned wasn't very useful. It was definitely interesting. The lectures are almost not worth going to. The textbook and lecture notes are great though.",
                "Grader was very harsh and occasionally point deductions did not make sense. Course staff did not respond well to feedback on this through the quarter, although some points were given back eventually.",
                "sometimes expectations for the proofs were pretty unclear, but when issues with that were brought up the instructors/TAs addressed it fairly",
                "There was grading that many students felt was too harsh and unfair but it was rectified halfway into the course."
            ],
            "Thinking about your time in the class, what aspect of the instructor's teaching contributed most to your learning?": [
                "Ng's notes are really clear.",
                "Prof. Ng is a uniquely skilled lecturer in that he clearly understands all of his lecture topics incredibly well but still understands how to make them accessible to undergrads and is well prepared without sounding formulaic.",
                "Absolutely one of the best theory sequence profs, cannot recommend highly enough (sorry I didn't talk more in class)",
                "His willingness to answer questions",
                "Timothy is an excellent lecturer, he is so good at breaking down complicated concepts",
                "explaining in lecture",
                "Timothy is a wonderful lecturer! Posting notes I found to be very helpful and he was also very responsive and helpful when answering questions",
                "Lectures and posted notes",
                "Professor Ng is extremely clear in the presentation of lectures.",
                "Notes",
                "Lectures, access to written online notes.",
                "Professor Ng is great at giving simple examples that illustrate the intuition behind methodologies, then extending that to a formalized abstract notion from which you can work with complex problems.",
                "Timothy Ng is an excellent lecturer. He is honestly one of the best math professors I have ever had. He was respectful, organized classes very well, always had very good examples to clarify concepts",
                "Professor Ng's lecture notes are the best; they are so exceptionally clear, detailed, and precise. They allowed me to grasp the content better at my own pace.",
                "lecture notes",
                "His lectures and posted notes and examples"
            ],
            "What could the instructor modify to help you learn more?": [
                "I wish the exam expectations had been clearer beforehand.",
                "not much... maybe explain grading expectations a bit sooner for the first couple of assignments",
                "Nothing",
                "A bit more clarity on how thorough our pseudo–code needs to be would have helped.",
                "Easier exams and problem sets. Having hard exams and psets doesn't help anyone learn, it just stresses people out.",
                "No comment, lectures and notes were well presented and very helpful.",
                "Nothing, he's great",
                "Posting more examples on how to format our proofs for our own proofs and algorithms that appear on Psets. Sometimes it was unclear what was required and expected of us in our proofs."
            ],
            "Please include the name of the TA/CA/Intern you are evaluating. What aspects of the TA's teaching contributed most to your learning? What could the TA modify to help you learn more? Please include any additional feedback for the TA/CA/Intern.": [
                "Jesse Stern",
                "Jesse Stern: I did not feel respected by him, but at least he was quick and helpful with his feedback",
                "Ruimin Zhang"
            ],
            "Please comment on the level of difficulty of the course relative to your background and experience.": [
                "This class is really hard (from a CS background, not a math background).",
                "Much more accessible than Discrete Math for people without a math background.",
                "About what I expected, easier workload than some other STEM classes I'm taking",
                "A little challenging for a CAAM major",
                "Discrete math was probably a little harder to grasp initially but algorithms required more deep thought... As a CS major, it was manageable overall",
                "Challenging but doable",
                "The homework assignments could be difficult, but I felt lectures adequately prepared me for them.",
                "Difficult, but fair. Assumes a decent proof–writing proficiency.",
                "I took and performed well in the honors calculus sequence and have studied proof mathematics in my own time. I still found this course to be exceptionally difficult; this is not a reasonable requirement to impose on every aspiring CS major."
            ]
        }
    },
    "13": {
        "course-section": "CMSC 28000 1",
        "instructors": "Timothy Ng",
        "quarter": "(2224) Spring 2022",
        "comments": {
            "What are the most important things that you learned in this course? Please reflect on the knowledge and skills you gained.": [
                "I think the most important thing has been to analyze how to approach formal problems (like decidability) and building up intuition and experience with the details required in such proofs.",
                "Regular languages, context–free languages, Turing machines.",
                "Learned about TM, DFA, NFA, and PDAs. Also learned how to construct proofs using induction.",
                "Automata theory, different types of string languages (regular, context–free, context–sensitive, unrestricted)",
                "Automata theory and computability of formal languages",
                "What formal languages are, a different way to think about computation and computational machines, Turing machines, limits of computing, regular and context–free languages",
                "DFAs, Pushdown Automata, Context free grammars, Turing machines. Inductive proofs",
                "Learning about finite automata (DFAs, Pushdown Automata, Turing Machines) and their associated language types (regular, context–free, Turing–recognizable)",
                "We learned about different models/tools to represent mathematical foundations of certain cs problems.",
                "Learning about formal languages and how different machines can be used to solve different problems.",
                "Formal language theory",
                "The logic and methods of Informal Languages and the constructions that can thusly be generated within their scope",
                "DFA, NFA, PDA, Turing Machines.",
                "Formal languages, different types of automata",
                "Classes of languages/automata, regular expressions, Turing machines, in general, the background behind theoretical CS",
                "How to think about solving problems, how computer science problems and algorithms can almost all be broken down into different \"machines.\" Generally, we learned about many different kinds of automata and the decidability of problems.",
                "I learned so much about the various classes of decision problems and how various machines/devices could represent them. There are regular languages that are contained in context–free languages that are contained in decidable languages. There are deterministic and nondeterministic finite automata, context–free grammars, pushdown automata, and Turing machines.",
                "languages, automata theory, making DFAs and PDAs, Turing machines",
                "Theoretical computer science and proof writing",
                "learned about finite automata, regular languages, context–free grammars, pushdown automata, decidability",
                "Regular languages/ Deterministic Finite Automata theory, context free languages, Turing machines and decidability.",
                "Automata theory, equivalence of automata, languages, and grammars"
            ],
            "Describe how aspects of this course (lectures, discussions, labs, assignments, etc.) contributed to your learning.": [
                "The lectures and lecture notes posted are, by far, the biggest contributions. Assignments are good in order to get some actual practice in, but in order to get to that point, the lecture notes provide vital information.",
                "Lecture notes on the website are detailed and helpful.",
                "Lecture and Lecture notes are well organized and is very helpful. In addition, PSETs are very helpful as well.",
                "Lectures were great to begin to understand the material and do assignments",
                "Lectures were good at introducing new topics to us and problem sets were good at applying those topics in proofs.",
                "prof ng has very good lecture notes",
                "Lectures were most helpful. They were 50 minutes, very clear, very easy to follow, and covered just about everything in the lecture notes. (Ng posted his lecture notes online after class and they were fantastic, I didn't need to take any notes during lecture and could just listen instead.) I came away from each lecture pretty much fully understanding the material. Office hours were held frequently and were good for asking questions. The problem sets were good––each had only three challenging questions, so they were helpful without requiring an excessive amount of work and time. The grading system was also nice, since problems on the psets and exams were graded on a 4 point scale.",
                "Perfect lectures. Very clear instruction. Good assignments, on the shorter side.",
                "Lectures were exceedingly helpful to learning the material and doing problem sets which were also very helpful in solidifying material and extending out what was learned in class.",
                "Homeworks were only three problems and you could resubmit again, which allowed in–depth understanding of each one.",
                "Lecture notes were the most useful in explaining concepts!",
                "The lecture notes were particularly useful, the problem sets, while hard, were also very useful to apply lecture materials to a problem–based context.",
                "Lectures and lecture notes were incredibly well put together, homework assignments were streamlined and helped build an intuition for the concepts.",
                "Lectures and notes were great!",
                "Lectures were extremely useful. Ng is great at explaining concepts. His notes are quite hefty, so lecture provides a nice roadmap along what would, on its own, be a thick reading. He's got a lot of passion and understanding of the material which made the class engaging.",
                "Lectures went too quickly for me, so I gained very little from most lectures honestly, but I went to office hours (usually multiple) every week and it was incredibly helpful. Professor Ng also posts all of his lecture notes which are usually pretty comprehensive and helpful too.",
                "Lectures were really important for understanding the material. While having access to lecture notes outside of the class was super helpful, the way Professor Ng talked about the material in class made the material seem less dense. Office hours with the TA's was also essential for doing well on the homework assignments.",
                "Lectures were clear and well–organized, assignments were reasonable.",
                "The lectures were very clear. Lecture notes were amazing.",
                "lectures were straightforward and direct; Timothy Ng's lecture notes were fantastic",
                "Lectures were all pretty clear and helpful for understanding the content. Ng also provided detailed and clear course notes if you ever need to miss a class.",
                "Lectures were helpful."
            ],
            "Additional comments about the course:": [
                "Professor Ng's notes are available online, this really helped tremendously (both before taking the course when I could get an idea of what material would actually be taught, and while taking the class since this provided high level details about what we covered in class).",
                "If you have a math background, this class will be a lot easier since it's basically just theoretical proofs. If you don't have any math background and didn't enjoy discrete math at all, I would think this class is a lot harder",
                "Extremely well organized. Legendary lectures. Good problems.",
                "N/A",
                "Amazing class. 11/10 would recommend."
            ],
            "Thinking about your time in the class, what aspect of the instructor's teaching contributed most to your learning?": [
                "As mentioned before, uploading the lecture notes online was a huge advantage while taking this class.",
                "The instructor is in general very nice and organizes the class well.",
                "He's very passionate and knowledgable about the subject and I can really feel the professor's love for the subject as he teaches in class.",
                "Prof Ng was great! His lecture notes are incredible and he's such an awesome instructor who explains things really well. His Office Hours were also very helpful",
                "Ng's lectures and lecture notes were extremely useful. He explained ideas very clearly in lectures and has succinct lecture notes posted on his website.",
                "Lectures were incredible, very engaging and easy to follow. Lecture notes were also beautiful and comprehensive",
                "His amazing lectures",
                "Very detailed lectures which were very well–organized and went through the material and proofs step by step.",
                "Honestly, office hours",
                "Being very good with lecture notes!",
                "The lecture notes were invaluable.",
                "Their lectures and office hours.",
                "Lectures and notes",
                "Ng's lecture notes and lectures are extremely useful. I also, appreciated the care he has for students. He has a very generous grading policy, allowing for resubmissions, which motivate you to truly learn the material.",
                "Professor Ng was very willing to explain pretty much anything in and out of class. Great prof, super nice guy, leaves his office door open when it's ok for you to go in and ask questions throughout the day/week. He also let us resubmit psets every week which actually was insanely helpful bc not only did we get to earn back points, we also actually learned the material consistently.",
                "Just the general lecturing because the structure of lectures was very organized",
                "Notes posted by the professor were really helpful, and problems on the homework gave good practice",
                "Great teaching style. Clear notes and presentation.",
                "very clear lecturer with good examples, very well–written lecture notes",
                "Professor Ng is a great professor, and I really enjoyed taking his class! He was great at lecturing and answering questions!",
                "Ng explained concepts very well, especially when explaining proofs that got a bit technical.",
                "Lectures were helpful."
            ],
            "What could the instructor modify to help you learn more?": [
                "I don't think that there really is anything Professor Ng could do. Perhaps upload even more practice problems so that the motivated student can get even more practice done?",
                "I think sometimes the instructor did not clarify the intuitions well. Often time I have to review the materials afterwards and come up with an entirely different understanding as how the instructor initially presented them.",
                "Nothing",
                "The grading scale was a little harsh, where each problem was on a 4–point scale. If proofs were not perfect, then you automatically got a 75% and most people had to do corrections for them.",
                "Office hours were held in Prof. Ng's office, which was a bit cramped and crowded. If they could be held in the same classroom as we had lecture in that would be much better",
                "nothing",
                "Not much in particular, the course we run excellently!",
                "N/A",
                "NIL",
                "Perhaps by providing more worked examples in lecture to better understand the application of theorems/proof–writing.",
                "Nothing.",
                "Not much",
                "Occasionally, the notes can be a bit much, but if you attend class, it's easy to parse through.",
                "I don't think this can be helped just bc of the nature of the content, but there's a lot of terminology that gets introduced very quickly and it made it difficult to keep up in class.",
                "Nothing.",
                "give more examples for homework",
                "Ng could probably go a little faster without losing much clarity."
            ],
            "Please include the name of the TA/CA/Intern you are evaluating. What aspects of the TA's teaching contributed most to your learning? What could the TA modify to help you learn more? Please include any additional feedback for the TA/CA/Intern.": [
                "N/A – I didn't interact with TA's often although I heard that Andy and Tiago were great from other students.",
                "Andy",
                "Tushant was super nice and generally very helpful, and really tried to make sure that we had a deep understanding of the concepts.",
                "Tushant and Tiago were vital for understanding how to attack the homework assignments.",
                "All three TAs Andy, Tiago and Tushant were very helpful and available",
                "Andy's office hours were super helpful. He was also generous to extend them sometimes."
            ],
            "Please comment on the level of difficulty of the course relative to your background and experience.": [
                "The course was fair difficulty compared to Algorithm class that I took previously for the major.",
                "The class has the reputation of being one of the easiest Theory C classes. However, I found the assignments to be extremely hard and often had to spend hours on a single problem.",
                "Hard if you have not taken a lot of proof classes but definitely manageable with OH.",
                "It was tough for a CS major without strong theory background",
                "requires a string background in proof writing, math majors are at an advantage",
                "Since I have a math background, it was much easier to understand and write proofs. If you don't like math and proofs, I'm not sure if I would recommend this class since it's mainly proofs",
                "Not too bad. Final was hard, which I loved. I would have liked the class to be harder but I've already taken Complexity Theory.",
                "Moderate, sometimes questions on assignments were difficult but the instructor was always available for help and helped a lot. Otherwise, the material was very manageable.",
                "It was better than discrete/algos",
                "not difficult – good level of Math required though",
                "Relatively mathematically intensive.",
                "It was fine, I came in with solid stat/math background though.",
                "This felt very different from algo at first, so I would say it was a bit difficult to adjust to, but overall very manageable.",
                "I'd taken Discrete Math and Theory of Algorithms before this, which helped, but this course was still pretty tough at times, although it's definitely do–able if you take advantage of the office hours",
                "I have taken discrete math and algorithms. This class was doable but still harder than both. It did introduce a lot of the fundamental concepts in CS that cleared up my understanding.",
                "This class was not particularly difficult, especially if you have some experience with general logic/set theory arguments"
            ]
        }
    },
    "14": {
        "course-section": "CMSC 28000 1",
        "instructors": "Timothy Ng",
        "quarter": "(2202) Winter 2020",
        "comments": {
            "What are the most important things that you learned in this course? Please reflect on the knowledge and skills you gained.": [
                "What formal languages are, how they relate to computing, essentially a history of early– to mid–twentieth century computing theory.",
                "Regular language, CFG, Turing machines",
                "I learned about the foundations of our computers at the math level from automata to Turing machines.",
                "Compatibility theory, DFAs, CFGs, and a bunch of other things.",
                "Finite Automata, regular languages, context free grammars, Turing Machines and undecidability. It's a great course for anyone interested in computer science theory/computability",
                "Deterministic finite automata, context–free grammars, regular expressions, Turing machines, decidability",
                "Regular language, context–free language, Turing machines",
                "different kinds of languages, machines, theorems",
                "Math. (This probably isn't too helpful, but seriously, it gave me a better sense of what theoretical CS/Math is like)",
                "Automata Theory. I learned a bunch."
            ],
            "Describe how aspects of this course (lectures, discussions, labs, assignments, etc.) contributed to your learning.": [
                "Lectures were super solid, and Tim also always posted very thorough notes. Homeworks were also a very appropriate difficulty, and actually gave us the chance to apply what we learned in lecture.",
                "Lectures and hw are great",
                "Lectures were very useful. Everything that we needed to know was provided in them and they were also nicely typed up and available online for reference.",
                "Supercalifragilisticexpialidocious lectures and awesome homeworks.",
                "Lectures and course notes were super helpful",
                "Lectures were very helpful and the lecture notes posted online after class were also great. The weekly problem sets were good practice and interesting in themselves.",
                "Lectures gave us initial exposure and foundation for concepts. The instructor also posted lecture notes online, and used piazza, both of which were extremely helpful when I had questions.",
                "Lecture notes are great!",
                "lectures were very informative, online notes were very helpful, homeworks were educational",
                "Classes were classes. They were engaging, and the instructor was good.",
                "Lectures and online notes were super good."
            ],
            "Additional comments about the course:": [
                "I really loved this class – I had no knowledge of what it was about coming in, but it turned out to be a ton of fun. I highly, highly recommend it, especially if Tim teaches it again! One of my favorite CS classes.",
                "Excellent instructor!",
                "Tim is a very good instructor and the his design of the course reflects just that. It has challenging topics at times, but in the end everything necessary for success is provided.",
                "This class should be a requirement (not elective) for every CS major."
            ],
            "Thinking about your time in the class, what aspect of the instructor's teaching contributed most to your learning?": [
                "Tim is one of the best professors I've had here! He has a super clear way of both explaining everything and answering questions, and makes it all feel super easy and simple.",
                "Lecture prompts questions and he is very knowledgeable and great at answering questions (sometimes links questions to bigger concepts)",
                "His knowledge and interest in the topic was notable. He was able to very quickly and easily answer all questions fielded at him and he very clearly knew what he was teaching. He always welcomed questions and did a good job making everyone feel included.",
                "Prof. Ng is the absolute best, the ultimate cool, and the supreme awesome.",
                "",
                "He is truly a remarkable educator. The CS department is very lucky to have him.",
                "Tim is really good at lecturing and his course notes are fantastic",
                "Tim was wonderful! He was a clear lecturer and responsive over Piazza. Also, he was always very reasonable with his expectations and interested in feedback from the students.",
                "The lectures were very clear and the lecture notes were the best of any class I've been in. The material was fascinating and every proof made perfect intuitive sense––which is not typical for me in math classes.",
                "Lecture notes are great. The lectures are also clear. HWs are reasonable",
                "very clear lecturer and willing to answer questions",
                "Very clear lecturer."
            ],
            "What could the instructor modify to help you learn more?": [
                "Nothing",
                "The only thing I would request would be more examples, but that is something not necessarily providable given the proof–based nature of the class.",
                "Prof. Ng is awesome–complete, so I don't think there is anything that he can modify and be more awesome.",
                "I feel like the pace of this class was too fast, but other than that everything was good.",
                "Maybe give out solutions to midterm and final exam practice questions a bit before the tests. Not really much though; it was a great class.",
                "nothing",
                "TA's were sometimes a little too strict in grading. I frequently found that they wanted more detail than I felt was necessary for an upper level course."
            ],
            "What aspects of the TA's teaching contributed most to your learning?": [
                "Jesse really knew what he was talking about and would never reveal the answer, instead opting to work with students to find the issue in their understanding.",
                "I did not interact with Jafar. Jesse was super helpful in office hours.",
                "Jesse was the best! His office hours were really helpful and I appreciated the video format."
            ],
            "What could the TA modify to help you learn more?": [
                "Sometimes he'd go off on tangents about something semi–related to a question which would make him not get through as much relevant material in a reasonable amount of time.",
                "Try to be more direct. Sometimes students have very specific hw questions but got a general conceptual explanation instead. If someone asks what time is it, tell them the time, not how to make a watch. If they ask more conceptual questions, then the stage is yours.",
                "Nothing"
            ],
            "Additional feedback to the TA/CA/Intern:": [
                "The videos for the office hours were very useful and unlike anything any other TA I've had has done before."
            ],
            "Please comment on the level of difficulty of the course relative to your background and experience.": [
                "Very appropriate!",
                "Latter part got more difficult but overall okay, very interesting",
                "Some of the topics are easy, but some of them are very difficult to conceptualize, but it was all ultimately doable without extreme headache.",
                "You must take this course, difficult or not.",
                "Taking discrete math before this class is definitely pretty helpful. The class gives a very fair amount of work and never felt overwhelming.",
                "Quite difficult unless you have a lot of experience writing rigorous proofs and constructingTuring machines.",
                "Easy. For the record, I had taken a summer workshop on the topic for a week and a half in high school.",
                "This was not that hard for somebody who is a 4th year Math and CS Major"
            ]
        }
    },
    "15": {
        "course-section": "CMSC 28000 1",
        "instructors": "Timothy Ng",
        "quarter": "(2212) Winter 2021",
        "comments": {
            "What are the most important things that you learned in this course? Please reflect on the knowledge and skills you gained.": [
                "Several of the important mathematical models of computation; their abilities and limitations. How to use mathematical techniques I'd learned in other classes, like diagonalization, to prove stuff that feels significant to the real world.",
                "Introduction to finite automata, pushdown automata, Turing Machines, and associated languages and problems",
                "The evolution of machines that recognized languages, from finite automata to turing machines.",
                "finite automata/regular languages, context–free languages/pushdown automata, Turing machines, decidability/decision problems on formal languages",
                "I learned about regular languages, Turing machines, Chomsky, and a lot more. We did a lot of proofs and theoretical math problems.",
                "Language models, finite automata, non–determinism, closure properties, formalisms for thinking about how to solve problems, etc. The course is a great intro to computational theory from the perspective of formal languages.",
                "Learned about theoretical machines that can recognize languages (finite automata, pushdown automata, Turing machines, etc.). Also learned how to prove certain properties of languages with these tools.",
                "Different models of computation and the problems they can solve. Regular languages, context free languages, computable languages.",
                "How problems can be modelled as binary decision problems & membership of strings.",
                "Mathematical models for computation like DFAs, PDAs and Turing Machines, and their corresponding language classes.",
                "Classes of languages (Chomsky hierarchy), and the machines that can process them (finite state automata, etc). Also some computability theory (what can be computed and in what time).",
                "How we can construct machine to recognize certain languages. Also the limits of how powerful each type of machine is and properties of the languages they recognize.",
                "Theoretical CS – regular, context free languages, pumping lemmas, automatas, Turing machines, etc.",
                "",
                "Unrelated but I felt deeply unprepared as a second year non–math major. So many proofs that I definitely was not ready for. I don't recommend taking this unless you're ready for a lot of proofs and theoretical CS! Easily spent 15–20 hours a week simply on 3 questions on the PSET alone.",
                "The ways computers actually solve problems",
                "Theory of computation, mathy things about CS",
                "I learned how to create machines that produce specific languages, and prove that these machines produce the language we want, based on the properties of the machine. We covered DFAs, NFAs, PDAs, and TMs.",
                "Defining kinds of problems and what it takes to solve them.",
                "The various ways in which computation is executed, and the capabilities of different automata."
            ],
            "Describe how aspects of this course (lectures, discussions, labs, assignments, etc.) contributed to your learning.": [
                "The lectures were excellent. Assigments weren't too long, but had very well chosen problems where you needed to understand the core concepts of each lecture to do them well.",
                "Problem Sets were designed well to be a great way to reinforce ideas taught in class. Lectures were great and Prof Ng released notes for every class that were incredibly detailed and useful.",
                "Lectures were essential! Very well planned and delivered. Lecture notes were also invaluable.",
                "lectures were given live and recordings were made available ASAP (within a few hours); lectures were a good pace, felt like i was learning things without being as disoriented/overwhelmed as i find myself in many math classes; Prof Ng took the time to go through the definitions thoroughly and gave helpful examples",
                "lectures also included some cs history tidbits, which actually helped me keep better track of the big ideas b/c it helped me follow the narrative of the development of these structures",
                "We had pre–recorded lectures three times a week. There was also a weekly problem set.",
                "Professor Ng has great recorded lectures and optional livestreams of those recordings. Homeworks were very reasonable and well–connected to the topics of the week. Homework gave us a chance to really grapple with the concepts in application.",
                "Lectures were live but also recorded with detailed notes. I found the notes extremely helpful for doing the homework since they usually contained relevant examples that could be applied to homework questions.",
                "Homeworks were most helpful",
                "Professor Ng provides detailed notes for every lecture. These were extremely helpful for reviewing material, and overall a great resource to have.",
                "Lectures were really clear, and had notes that accompanied them, which are a LIVESAVER. Weekly PSETs were appropriate length and well suited to what we had learned. The final exam was take home, which was helpful.",
                "lecture + video notes were helpful for completing the PSETS",
                "Lectures and online notes were extremely well done and very clear. Assignments and suggested problems were a great way to make sure we understood the material.",
                "Lectures were all asynchronous – very helpful!",
                "Lectures were always very informative and had examples related to the homework. Office hours were also extremely useful.",
                "Lectures introduced material, p–sets allowed students to engage and really learn material.",
                "Lectures were dense (but this was unavoidable given the course material) and the psets made me think about the lectures more."
            ],
            "What aspect of the instructor's teaching contributed most to your learning?": [
                "Lectures were great: interesting, well paced and well motivated. The music before them was a nice way to start the day.",
                "Great at breaking down and explaining certain concepts and had very thorough notes which made almost no concept too difficult to embrace. Incredible instructor!",
                "Lecture notes",
                "Prof. Ng structured the course very well (content pacing, hw assignment design, logistical stuff like campuswire/gradescope), and it felt like a course designed to be online (as opposed to a course shoved onto canvas+zoom+panopto). Prof. Ng was very responsive on campuswire (similar to piazza but much more user–friendly imo) and kept the threads organized.",
                "Prof. Ng also gave us optional (+1% bonus on your final grade for each, 5 total) reflections to fill out every other week where we'd answer 4–5 questions about how we felt the course was going, what we did/didn't feel great about, our goals and our progress on them, etc. I loved the reflections, it really felt like Prof. Ng wanted to intentionally make space to check in with all of his students and not just those who could attend class live or make it to office hours.",
                "The lectures were very informative.",
                "Professor Ng provides excellent written notes on every lecture that are very helpful for review. In general, he's also very accommodating (e.g. late policy on all assignments) and good at communicating complex topics.",
                "The format of the notes was probably the most helpful for completing the assignments since it provided an easy reference for how to solve certain types of problems. The lectures were also good for a more in depth explanation for the material. Also the grading scheme is pretty hype. I never missed an assignment, but I also never felt stressed about needing to do perfectly on the problem sets because the grading scheme was favorable.",
                "Professor Ng is great at explaining concepts in lecture, and providing examples and motivation for each topic. His lecture notes were extremely helpful. And I loved the music before each lecture.",
                "Prof. Ng is super nice, and also super clear in his explanations. He really wants you to do well. The lecture notes are awesome. I'm not sure I totally understood the grading scale in this class, but I think it will work out well for all the students.",
                "The incredibly thorough lecture notes were very helpful.",
                "The lectures and online notes were excellent. Campuswire also provided a great way to ask questions outside of class.",
                "Professor Ng was very clear in explanations, and the problem sets were difficult but helped bolster things we learnt.",
                "I really appreciated Professor Ng's clear lecture style, and he was always very quick to respond to my questions on Campuswire. I also attended office hours quite often, and he always helped me understand the material better.",
                "Prof Ng's lectures are interesting and accessible, and provides good intuition for the material in the notes.",
                "Very kind, clear lecture notes, problem sets that helped teach key parts of material but weren't too overwhelming.",
                "Regular office hours and being able to explain concepts really well for people like me who haven't taken many proof based classes."
            ],
            "What could the instructor modify to help you learn more?": [
                "I think some kind of problem solving session could have been nice. While there were certainly enough resources to meet with the professor and TA's, I didn't really meet any new students in the class.",
                "Nothing – was great",
                "I can't think of anything, Prof. Ng is one of my favorite instructors I've had a UChicago!",
                "Problem solving sessions where we worked through problems would be helpful.",
                "Nothing, this is a really great (and challenging) course!",
                "Math lectures are really dry and by the end I mostly just read the lecture notes. Maybe only lecturing isn't the best way to teach material?"
            ],
            "Please elaborate on the above.": [
                "Was a great class – lectures were either Synchronous or Asynchronous depending on what the student wanted. I watched them all asynchronously and it was great",
                "I wasn't able to make it to office hours, but there were multiple times available so that seemed good! The homework was wonderful (3 problems to turn in for a grade, plus 5–10 exercises you could do on your own if you wanted), it was a good length, was challenging but not mind–numbingly difficult, and we got thorough feedback from graders!",
                "The problem sets and lectures were most helpful in the class.",
                "Definitely go to office hours if you're struggling with certain concepts. The TA's and the instructor are super helpful.",
                "I never attended the lectures live since I had a scheduling conflict, but the recordings and notes were more than sufficient in learning the material. Campuswire was also a good place to ask questions if I wasn't sure about something.",
                "Prof. Ng is really good in OH, even over Zoom",
                "I really appreciated the format of the class, with a single, take–home final (no midterm or any timed assessments) and a single pset with only 3 questions per week. The class was still very challenging, but it was never unnecessarily stressful because of assessments. I was able to really absorb content and express my knowledge for the subject with the take–home assessment format.",
                "Lectures were livestreamed and the livestream was recorded. From what I know, very few people attended the livestream and most people watched the recording of the livestream, later.",
                "Problem sets were very well crafted. Lectures were good and clear (as were lecture notes) but very dry.",
                "There were always enough office hours and the ta's and professor were very helpful."
            ],
            "Did the instructor make adjustments to the course mid-quarter? If so, please comment on the effectiveness of those adjustments.": [
                "No",
                "N/A – none was needed",
                "A few weeks into the quarter we started to be given a one–day automatic extension on homework; no penalty beyond the consequences of being behind on work, no questions asked, 24 extra hours. I really appeciated this b/c my Monday–Wednesday was when all of my work was due, so having until Thursday 8pm to hand in this hw was a godsend.",
                "I didn't notice anything else change in particular, but Prof. Ng seemed to be paying attention to our biweekly reflections (every now and then he would mention something from them in passing) so maybe things were being adjusted behind the scenes and I just didn't notice.",
                "NO",
                "A late policy was introduced sometime around weeks 3/4 for the homework, and it was very generous.",
                "n/a"
            ],
            "Please describe any element of this course, including specific actions by the instructor, that improved your remote learning experience.": [
                "There were a lot of office hours, which was nice especially with no in person classes.",
                "Incredible notes were very useful to refer to when going through problem sets.",
                "I loved the optional reflections! It definitely made me be more thoughtful about how I was approaching my studies, and it held me accountable for acknowledging when I needed to change my strategies of completing lecture videos/hw assignments efficiently.",
                "He recorded the lectures which made them easy to watch on your own time.",
                "Clear communication on CampusWire, excellent notes, and recorded lectures.",
                "The detailed notes and the grading scheme made this class miles better in a remote setting compared to some of the other CS classes I've taken remotely.",
                "I thought the remote learning was handled well b/c the course was so organized (with the lecture notes and problem sets)",
                "Campuswire was great for the remote learning experience, even more so than in person.",
                "I'm glad lectures were recorded, because there was so much material covered in each one that I often needed to pause and replay them.",
                "Lectures streamed and saved on Panopto gave us the chance to pause or rewind during streams which helps when taking notes, but also allows asking questions during the lecture.",
                "The grading scheme was really nice, missed points on psets didn't strictly hurt your grade which gave the course a flexibility that was really beneficial in winter quarter during a pandemic.",
                "Not having timed tests."
            ],
            "Please include the name of the TA/CA/Intern you are evaluating. What aspects of the TA's teaching contributed most to your learning? What could the TA modify to help you learn more? Please include any additional feedback for the TA/CA/Intern.": [
                "Jesse was very willing to discuss question in depth",
                "Jesse Stern had helpful office hours and good feedback on homeworks.",
                "There were 2 TA's. Jesse Stern was very helpful with clearing up concepts and working on the psets. I didn't attend the other TA's office hours due to scheduling.",
                "Tiago! His 8am office hours, although early, were so helpful! I definitely would've withdrawn or failed the class without him.",
                "Jesse Stern was a great TA, very helpful in office hours and definitely got me more interested in the Mathematics of Computer Science.",
                "Tiago! He is the absolute best. Super helpful every time. The other TA (Jesse?) was very unhelpful."
            ]
        }
    },
    "16": {
        "course-section": "CMSC 28000 1",
        "instructors": "Timothy Ng",
        "quarter": "(2234) Spring 2023",
        "comments": {
            "What are the most important things that you learned in this course? Please reflect on the knowledge and skills you gained.": [
                "How languages work",
                "DFAs, PDAs, TMs",
                "Computability theory.",
                "Regular languages/DFA's, context–free grammars/PDA's, and computability/Turing machines. Proof by induction is heavily emphasized. Proofs need to be watertight, or graders will heavily mark down.",
                "Regular languages, context–free languages, decidable languages",
                "regular languages, context free languages, Turing machines, decidability",
                "The evolution of automata theory: DFA/NFA and regular languages, PDA and context–free languages, Turing–machines, decidability problems,....",
                "The concept of languages as understood by a machine",
                "Learned about the theory of processing words, aka making languages (sets of words)",
                "Basics of computational theory. The pedagogical order was finite state automata and regular languages, pushdown automata and context–free languages/grammars, and then computability and Turing Machines. The question I set out to answer was: \"how can someone say computer science existed before computers?\" and I think I have satiated my theoretical curiousity.",
                "I learned about language constructions and how they can be used for the concepts that deal with the theory of computation.",
                "deterministic/non–deterministic finite automata, context–free grammars, pushdown automata, Turing machines, properties that make a language regular, not regular, context–free, decidable, etc.",
                "types of grammars and the language classes/machines they corresponded to: e.g. regular languages/DFAs, context–free grammars/pushdown automata, Turing Machines",
                "automatons, turing machines",
                "Automata theory, regular and context free languages, decision problems in automata, relationship between certain data structures and formal language theory",
                "How to work with finite automata and Turing machines; what regular languages and context–free languages are and how to prove things about them; how to prove that a problem is decidable or not decidable"
            ],
            "Describe how aspects of this course (lectures, discussions, labs, assignments, etc.) contributed to your learning.": [
                "Skipped about 2/3 of lectures. Notes posted online were sufficient, and the slow pace was fairly unbearable. I feel that 1.5–2x as much material could've been covered if it had moved at a normal pace relative to every other class I've taken here. That said, material was interesting and the course staff was great, helpful, caring etc. Just needs to be conducted like a real college class.",
                "they are ok. mostly it's self learning. lecture notes are helpful.",
                "I would say the homeworks helped me the most",
                "The professor, TA's, and just organization of this course in general is astounding. If you don't know which third theory class to take, choose this one.",
                "lectures were quite well–presented; onlines are also super helpful as a reference––they cover all teh required material and are thus very convenient",
                "lectures were very engaging and strongly supported by high–grade lecture notes from Prof.Ng.",
                "Everything in the class contributed to my learning",
                "Lectures were very clear, along with the posted notes.",
                "Prof Ng's course notes are insane. I don't understand why every instructor doesn't do this. They literally add so much organization and ease for students (and probably the professor as well). Also, they don't take away from lectures. I didn't attend lectures for a week and I only used the course notes that week and my understanding wasn't as substantial since I tried to jam my way through all the material at once. The lectures put the material into your head and you can let it marinate, and then consolidate your knowledge with the course notes.",
                "Lectures were helpful and notes online made it easier to refer to course content when working on assignments.",
                "the lecture notes and office hours were vital to my learning",
                "lectures were very well–organized, with a clear progression throughout the quarter (material built on each other), and examples for each concept that was discussed. posted lecture notes were equally great, and allowed me to learn all the material even if I wasn't in class.",
                "lectures and notes were great",
                "Lectures were extremely helpful and notes were extraordinary, allowing for great gain from the material.",
                "Lectures were clear and organized! Professor Ng's notes online were very helpful, too. Problem sets were good because they didn't involve too many problems, so you could really dig deep on the problems that were assigned. I think they did a great job of solidifying the course content – problems were chosen well."
            ],
            "Additional comments about the course:": [
                "I like that we were permitted to resubmit assignments, but sometimes the comments from TAs were so lackluster that I could hardly figure out how to improve my answers",
                "Nope",
                "really appreciated the regrades; grading on homeworks was sometimes unncessarily harsh with points being deducted for minor things, but allowing for regrades compnesated for this and was very nice",
                "This is just a wonderful class. What a breath of fresh air after the shipwreck that is algorithms. Just take it!",
                "This course just felt like a lot. Assignments every week, with revisions with those too, as well as writing an entire report. My main criticism is how the report was handled. It would be nice to have a week without a problem set, so we can focus on the report instead. That week just felt like a lot.",
                "Professor Ng is one of the few professors I've had in my time at UChicago that actually keeps pace with the planned material. The coverage wasn't too ambitious and I'm glad we got through it all. I despise when we don't end up learning all the material that was promised in the beginning of the course. Again, the course notes are tremendously helpful in this regard",
                "Resubmissions were helpful when understanding course content.",
                "None",
                "I loved this course. In particular, Tim Ng was likely the best CS professor I have ever had. He actually cares about making the students learn and grow their interest in the topics studied by providing examples of how the material relates to cutting–edge CS theory research.",
                "Professor Ng is a phenomenal instructor and cares a lot more about teaching than most professors here.",
                "This is a CS theory course and as is the case with all CS theory courses here, people who aren't math majors are likely to struggle with the proofs. It was really nice that Professor Ng offered revisions for all problems on the problem sets, as that gave people the opportunity to learn and improve with their proof–writing."
            ],
            "Thinking about your time in the class, what aspect of the instructor's teaching contributed most to your learning?": [
                "Always willing to answer questions, goes pretty, slowly, very understandable",
                "Notes posted online",
                "lecture notes",
                "Professor Ng is an excellent lecturer and his course was extremely well–organized.",
                "Professor makes time for his students.",
                "Ng is great at lectures and his online notes were also super well typed and helpful. Very well organized course overall",
                "Prof. Ng was not only passionate about the topic but he was also very accommodating to different backgrounds and situations that students might be facing. He only cared about whether everyone in class actually learned something fro mt he course.",
                "Professor, was incredibly meticulous in his lectures. He challenged us to engage in his lectures.(literally we would have minutes of awkward silence until someone answered) He held so many office hours, running over at times. He was so responsive over Ed. He poured so much into the notes. Just above and beyond.",
                "He was very helpful and available outside of class.",
                "The consistent and small psets. I really like having a few practice problems every week to solidify my understanding.",
                "Lectures were helpful and the professor offered several office hours to help students out.",
                "Lectures note, problem sets and office hours contributed the most to my learning",
                "Professor Ng explains very very well. He is very organized and very thorough. He made an otherwise difficult course easy to follow and his notes were amazing. He was a great instructor! 10/10 would highly recommend!",
                "Tim is one of the best professors I've had here – he breaks down potentially–confusing concepts in an organized, easy–to–understand way (even if I didn't understand it on the spot, I knew I could go through the lecture notes later and they'd help me internalize the concepts). Also, he was quite available and invested in helping us during office hours without giving the answer to HW problems away.",
                "notes were good, lectures were good, he is also helpful outside of class",
                "Lectures and lecture notes were amazing, have nothing to complain about the instructor.",
                "The notes on his website are amazing. He motivated things very well. He's also kind and understanding. He's pretty great in every way!"
            ],
            "What could the instructor modify to help you learn more?": [
                "Drop lowest assignment?",
                "Cover more material",
                "sometimes the lecture comes from nowhere. also, the resubmission procedure is too complicated.",
                "None!",
                "During OH, would be great if he could give a little more tips. I feel like he gave out small hints, but it was often not much more than what we woudl've figuired out after a little bit of thought.",
                "N/A",
                "honestly nothing. If I don't do as well in this class it was totally a me problem",
                "Nothing!",
                "to be honest, I wasn't a huge fan of the midterm projects. I think a midterm examination would have been more beneficial to my learning, but that is personal opinion.",
                "Maybe holding office hours in a classroom since the office space was smaller and could get pretty packed pretty quickly.",
                "Not sure. I think I just needed more time to grasp the material.",
                "nothing",
                "NA",
                "Encourage a bit more participation in class.",
                "Can't think of anything!"
            ],
            "Please include the name of the TA/CA/Intern you are evaluating. What aspects of the TA's teaching contributed most to your learning? What could the TA modify to help you learn more? Please include any additional feedback for the TA/CA/Intern.": [
                "Laura Zielinski. Fantastic TA, hire her again. Very knowledgeable about the course material, able to take any ill–conceived question and think on her feet, and very friendly.",
                "Laura, Tiago, and Nyaga are all amazing TA's. They were all very smart, happy to help, and very organized.",
                "Nyaga",
                "Tiago. Tiago was cool. He is pretty helpful when you come prepared which is fair.",
                "Laura Zielinski was a great answerer on Ed.",
                "Tyago, Laura",
                "Laura, Nyaga, Tiago – all very helpful and responsive on Ed, sometimes even stayed beyond allotted time to help!",
                "Nyaga was a great TA! He explained things very clearly in office hours"
            ],
            "Please comment on the level of difficulty of the course relative to your background and experience.": [
                "This course is definitely catered to those students with a strong background in proofs and mathematics in general",
                "Very easy, light workload",
                "If you are a math major or have taken Complexity Theory, this class will be extremely easy. If you are a computer science student with less experience in proof–based math, this course may be more difficult, but easier than other Theory sequence courses.",
                "for a CS course, workload is very reasonable and as a math major, proof writing wasn't much of a challenge, though the nature of proofs is definitrely different",
                "This course is better than other Computer Science theory courses offered for the CS major",
                "It is not difficult if you put in the time",
                "It was fair. I am very bad at theory and proofs. But I was eased into it and gained a lot throughout the quarter.",
                "I think this course is more manageable than Theory of Algorithms.",
                "I had only taken the required theory class prior to this class and I found this course took most of my time. Definitely recommend going to office hours if you think you have a weak background in math/proof writing as I did.",
                "still pretty challenging even though I've heard it's a chill option for theory requirement, because the topics and way of thinking were different than what I'd done before.",
                "Only theory experience was 271/272. This was not hard to grasp, also quite interesting!",
                "Challenging but rewarding",
                "I'm a math major, and this course was very manageable. Didn't require any content that I learned in previous courses, but it's obviously helpful to be familiar with proofs since this is a theoretical course."
            ]
        }
    }
}